betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
/*******************  Bit definition for ADC_INJDATA1 register  *******************/
#define ADC_INJDATA1_INJDATA_Pos                                    (0U)
#define ADC_INJDATA1_INJDATA_Msk                                    (0xFFFFUL << ADC_INJDATA1_INJDATA_Pos)                         /*!< 0x0000FFFF */
#define ADC_INJDATA1_INJDATA                                        ADC_INJDATA1_INJDATA_Msk                                       /*!<Injected data */

/*******************  Bit definition for ADC_INJDATA2 register  *******************/
#define ADC_INJDATA2_INJDATA_Pos                                    (0U)
#define ADC_INJDATA2_INJDATA_Msk                                    (0xFFFFUL << ADC_INJDATA2_INJDATA_Pos)                         /*!< 0x0000FFFF */
#define ADC_INJDATA2_INJDATA                                        ADC_INJDATA2_INJDATA_Msk                                       /*!<Injected data */

/*******************  Bit definition for ADC_INJDATA3 register  *******************/
#define ADC_INJDATA3_INJDATA_Pos                                    (0U)
#define ADC_INJDATA3_INJDATA_Msk                                    (0xFFFFUL << ADC_INJDATA3_INJDATA_Pos)                         /*!< 0x0000FFFF */
#define ADC_INJDATA3_INJDATA                                        ADC_INJDATA3_INJDATA_Msk                                       /*!<Injected data */

/*******************  Bit definition for ADC_INJDATA4 register  *******************/
#define ADC_INJDATA4_INJDATA_Pos                                    (0U)
#define ADC_INJDATA4_INJDATA_Msk                                    (0xFFFFUL << ADC_INJDATA4_INJDATA_Pos)                         /*!< 0x0000FFFF */
#define ADC_INJDATA4_INJDATA                                        ADC_INJDATA4_INJDATA_Msk                                       /*!<Injected data */

/********************  Bit definition for ADC_REGDATA register  ********************/
#define ADC_REGDATA_REGDATA_Pos                                     (0U)
#define ADC_REGDATA_REGDATA_Msk                                     (0xFFFFUL << ADC_REGDATA_REGDATA_Pos)                          /*!< 0x0000FFFF */
#define ADC_REGDATA_REGDATA                                         ADC_REGDATA_REGDATA_Msk                                        /*!<Regular data */

/*******************  Bit definition for ADC_CCTRL register  ********************/
#define ADC_CCTRL_ADCMSEL_Pos                                       (0U)
#define ADC_CCTRL_ADCMSEL_Msk                                       (0x1FUL << ADC_CCTRL_ADCMSEL_Pos)                              /*!< 0x0000001F */
#define ADC_CCTRL_ADCMSEL                                           ADC_CCTRL_ADCMSEL_Msk                                          /*!<MULTI[4:0] bits (Multi-ADC mode selection) */
#define ADC_CCTRL_ADCMSEL_0                                         (0x01UL << ADC_CCTRL_ADCMSEL_Pos)                              /*!< 0x00000001 */
#define ADC_CCTRL_ADCMSEL_1                                         (0x02UL << ADC_CCTRL_ADCMSEL_Pos)                              /*!< 0x00000002 */
#define ADC_CCTRL_ADCMSEL_2                                         (0x04UL << ADC_CCTRL_ADCMSEL_Pos)                              /*!< 0x00000004 */
#define ADC_CCTRL_ADCMSEL_3                                         (0x08UL << ADC_CCTRL_ADCMSEL_Pos)                              /*!< 0x00000008 */
#define ADC_CCTRL_ADCMSEL_4                                         (0x10UL << ADC_CCTRL_ADCMSEL_Pos)                              /*!< 0x00000010 */
#define ADC_CCTRL_SMPDEL2_Pos                                       (8U)
#define ADC_CCTRL_SMPDEL2_Msk                                       (0xFUL << ADC_CCTRL_SMPDEL2_Pos)                               /*!< 0x00000F00 */
#define ADC_CCTRL_SMPDEL2                                           ADC_CCTRL_SMPDEL2_Msk                                          /*!<DELAY[3:0] bits (Delay between 2 sampling phases) */
#define ADC_CCTRL_SMPDEL2_0                                         (0x1UL << ADC_CCTRL_SMPDEL2_Pos)                               /*!< 0x00000100 */
#define ADC_CCTRL_SMPDEL2_1                                         (0x2UL << ADC_CCTRL_SMPDEL2_Pos)                               /*!< 0x00000200 */
#define ADC_CCTRL_SMPDEL2_2                                         (0x4UL << ADC_CCTRL_SMPDEL2_Pos)                               /*!< 0x00000400 */
#define ADC_CCTRL_SMPDEL2_3                                         (0x8UL << ADC_CCTRL_SMPDEL2_Pos)                               /*!< 0x00000800 */
#define ADC_CCTRL_DMAMODEDISSEL_Pos                                 (13U)
#define ADC_CCTRL_DMAMODEDISSEL_Msk                                 (0x1UL << ADC_CCTRL_DMAMODEDISSEL_Pos)                         /*!< 0x00002000 */
#define ADC_CCTRL_DMAMODEDISSEL                                     ADC_CCTRL_DMAMODEDISSEL_Msk                                    /*!<DMA disable selection (Multi-ADC mode) */
#define ADC_CCTRL_DMAMODE_Pos                                       (14U)
#define ADC_CCTRL_DMAMODE_Msk                                       (0x3UL << ADC_CCTRL_DMAMODE_Pos)                               /*!< 0x0000C000 */
#define ADC_CCTRL_DMAMODE                                           ADC_CCTRL_DMAMODE_Msk                                          /*!<DMA[1:0] bits (Direct Memory Access mode for multimode) */
#define ADC_CCTRL_DMAMODE_0                                         (0x1UL << ADC_CCTRL_DMAMODE_Pos)                               /*!< 0x00004000 */
#define ADC_CCTRL_DMAMODE_1                                         (0x2UL << ADC_CCTRL_DMAMODE_Pos)                               /*!< 0x00008000 */
#define ADC_CCTRL_ADCPRE_Pos                                        (16U)
#define ADC_CCTRL_ADCPRE_Msk                                        (0x3UL << ADC_CCTRL_ADCPRE_Pos)                                /*!< 0x00030000 */
#define ADC_CCTRL_ADCPRE                                            ADC_CCTRL_ADCPRE_Msk                                           /*!<ADCPRE[1:0] bits (ADC prescaler) */
#define ADC_CCTRL_ADCPRE_0                                          (0x1UL << ADC_CCTRL_ADCPRE_Pos)                                /*!< 0x00010000 */
#define ADC_CCTRL_ADCPRE_1                                          (0x2UL << ADC_CCTRL_ADCPRE_Pos)                                /*!< 0x00020000 */
#define ADC_CCTRL_VBATEN_Pos                                        (22U)
#define ADC_CCTRL_VBATEN_Msk                                        (0x1UL << ADC_CCTRL_VBATEN_Pos)                                /*!< 0x00400000 */
#define ADC_CCTRL_VBATEN                                            ADC_CCTRL_VBATEN_Msk                                           /*!<VBAT Enable */
#define ADC_CCTRL_TSVREFEN_Pos                                      (23U)
#define ADC_CCTRL_TSVREFEN_Msk                                      (0x1UL << ADC_CCTRL_TSVREFEN_Pos)                              /*!< 0x00800000 */
#define ADC_CCTRL_TSVREFEN                                          ADC_CCTRL_TSVREFEN_Msk                                         /*!<Temperature Sensor and VREFINT Enable */

/******************************************************************************/
/*                                                                            */
/*                         Controller Area Network                            */
/*                                                                            */
/******************************************************************************/
/*!<CAN control and status registers */
/*******************  Bit definition for CAN_MCTRL register  ********************/
#define CAN_MCTRL_INITREQ_Pos                                       (0U)
#define CAN_MCTRL_INITREQ_Msk                                       (0x1UL << CAN_MCTRL_INITREQ_Pos)                               /*!< 0x00000001 */
#define CAN_MCTRL_INITREQ                                           CAN_MCTRL_INITREQ_Msk                                          /*!<Initialization Request */
#define CAN_MCTRL_SLEEPREQ_Pos                                      (1U)
#define CAN_MCTRL_SLEEPREQ_Msk                                      (0x1UL << CAN_MCTRL_SLEEPREQ_Pos)                              /*!< 0x00000002 */
#define CAN_MCTRL_SLEEPREQ                                          CAN_MCTRL_SLEEPREQ_Msk                                         /*!<Sleep Mode Request */
#define CAN_MCTRL_TXFPCFG_Pos                                       (2U)
#define CAN_MCTRL_TXFPCFG_Msk                                       (0x1UL << CAN_MCTRL_TXFPCFG_Pos)                               /*!< 0x00000004 */
#define CAN_MCTRL_TXFPCFG                                           CAN_MCTRL_TXFPCFG_Msk                                          /*!<Transmit FIFO Priority */
#define CAN_MCTRL_RXFLOCK_Pos                                       (3U)
#define CAN_MCTRL_RXFLOCK_Msk                                       (0x1UL << CAN_MCTRL_RXFLOCK_Pos)                               /*!< 0x00000008 */
#define CAN_MCTRL_RXFLOCK                                           CAN_MCTRL_RXFLOCK_Msk                                          /*!<Receive FIFO Locked Mode */
#define CAN_MCTRL_ARTXMD_Pos                                        (4U)
#define CAN_MCTRL_ARTXMD_Msk                                        (0x1UL << CAN_MCTRL_ARTXMD_Pos)                                /*!< 0x00000010 */
#define CAN_MCTRL_ARTXMD                                            CAN_MCTRL_ARTXMD_Msk                                           /*!<No Automatic Retransmission */
#define CAN_MCTRL_AWUPCFG_Pos                                       (5U)
#define CAN_MCTRL_AWUPCFG_Msk                                       (0x1UL << CAN_MCTRL_AWUPCFG_Pos)                               /*!< 0x00000020 */
#define CAN_MCTRL_AWUPCFG                                           CAN_MCTRL_AWUPCFG_Msk                                          /*!<Automatic Wakeup Mode */
#define CAN_MCTRL_ALBOFFM_Pos                                       (6U)
#define CAN_MCTRL_ALBOFFM_Msk                                       (0x1UL << CAN_MCTRL_ALBOFFM_Pos)                               /*!< 0x00000040 */
#define CAN_MCTRL_ALBOFFM                                           CAN_MCTRL_ALBOFFM_Msk                                          /*!<Automatic Bus-Off Management */
#define CAN_MCTRL_TTCM_Pos                                          (7U)
#define CAN_MCTRL_TTCM_Msk                                          (0x1UL << CAN_MCTRL_TTCM_Pos)                                  /*!< 0x00000080 */
#define CAN_MCTRL_TTCM                                              CAN_MCTRL_TTCM_Msk                                             /*!<Time Triggered Communication Mode */
#define CAN_MCTRL_SWRST_Pos                                         (15U)
#define CAN_MCTRL_SWRST_Msk                                         (0x1UL << CAN_MCTRL_SWRST_Pos)                                 /*!< 0x00008000 */
#define CAN_MCTRL_SWRST                                             CAN_MCTRL_SWRST_Msk                                            /*!<bxCAN software master reset */
#define CAN_MCTRL_DBGFRZE_Pos                                       (16U)
#define CAN_MCTRL_DBGFRZE_Msk                                       (0x1UL << CAN_MCTRL_DBGFRZE_Pos)                               /*!< 0x00010000 */
#define CAN_MCTRL_DBGFRZE                                           CAN_MCTRL_DBGFRZE_Msk                                          /*!<bxCAN Debug freeze */
/*******************  Bit definition for CAN_MSTS register  ********************/
#define CAN_MSTS_INITFLG_Pos                                        (0U)
#define CAN_MSTS_INITFLG_Msk                                        (0x1UL << CAN_MSTS_INITFLG_Pos)                                /*!< 0x00000001 */
#define CAN_MSTS_INITFLG                                            CAN_MSTS_INITFLG_Msk                                           /*!<Initialization Acknowledge */
#define CAN_MSTS_SLEEPFLG_Pos                                       (1U)
#define CAN_MSTS_SLEEPFLG_Msk                                       (0x1UL << CAN_MSTS_SLEEPFLG_Pos)                               /*!< 0x00000002 */
#define CAN_MSTS_SLEEPFLG                                           CAN_MSTS_SLEEPFLG_Msk                                          /*!<Sleep Acknowledge */
#define CAN_MSTS_ERRIFLG_Pos                                        (2U)
#define CAN_MSTS_ERRIFLG_Msk                                        (0x1UL << CAN_MSTS_ERRIFLG_Pos)                                /*!< 0x00000004 */
#define CAN_MSTS_ERRIFLG                                            CAN_MSTS_ERRIFLG_Msk                                           /*!<Error Interrupt */
#define CAN_MSTS_WUPIFLG_Pos                                        (3U)
#define CAN_MSTS_WUPIFLG_Msk                                        (0x1UL << CAN_MSTS_WUPIFLG_Pos)                                /*!< 0x00000008 */
#define CAN_MSTS_WUPIFLG                                            CAN_MSTS_WUPIFLG_Msk                                           /*!<Wakeup Interrupt */
#define CAN_MSTS_SLEEPIFLG_Pos                                      (4U)
#define CAN_MSTS_SLEEPIFLG_Msk                                      (0x1UL << CAN_MSTS_SLEEPIFLG_Pos)                              /*!< 0x00000010 */
#define CAN_MSTS_SLEEPIFLG                                          CAN_MSTS_SLEEPIFLG_Msk                                         /*!<Sleep Acknowledge Interrupt */
#define CAN_MSTS_TXMFLG_Pos                                         (8U)
#define CAN_MSTS_TXMFLG_Msk                                         (0x1UL << CAN_MSTS_TXMFLG_Pos)                                 /*!< 0x00000100 */
#define CAN_MSTS_TXMFLG                                             CAN_MSTS_TXMFLG_Msk                                            /*!<Transmit Mode */
#define CAN_MSTS_RXSIGLMFLG_Pos                                     (9U)
#define CAN_MSTS_RXSIGLMFLG_Msk                                     (0x1UL << CAN_MSTS_RXSIGLMFLG_Pos)                             /*!< 0x00000200 */
#define CAN_MSTS_RXSIGLMFLG                                         CAN_MSTS_RXSIGLMFLG_Msk                                        /*!<Receive Mode */
#define CAN_MSTS_LSAMVALUE_Pos                                      (10U)
#define CAN_MSTS_LSAMVALUE_Msk                                      (0x1UL << CAN_MSTS_LSAMVALUE_Pos)                              /*!< 0x00000400 */
#define CAN_MSTS_LSAMVALUE                                          CAN_MSTS_LSAMVALUE_Msk                                         /*!<Last Sample Point */
#define CAN_MSTS_RXSIGL_Pos                                         (11U)
#define CAN_MSTS_RXSIGL_Msk                                         (0x1UL << CAN_MSTS_RXSIGL_Pos)                                 /*!< 0x00000800 */
#define CAN_MSTS_RXSIGL                                             CAN_MSTS_RXSIGL_Msk                                            /*!<CAN Rx Signal */

/*******************  Bit definition for CAN_TXSTS register  ********************/
#define CAN_TXSTS_REQCFLG0_Pos                                      (0U)
#define CAN_TXSTS_REQCFLG0_Msk                                      (0x1UL << CAN_TXSTS_REQCFLG0_Pos)                              /*!< 0x00000001 */
#define CAN_TXSTS_REQCFLG0                                          CAN_TXSTS_REQCFLG0_Msk                                         /*!<Request Completed Mailbox0 */
#define CAN_TXSTS_TXSUSFLG0_Pos                                     (1U)
#define CAN_TXSTS_TXSUSFLG0_Msk                                     (0x1UL << CAN_TXSTS_TXSUSFLG0_Pos)                             /*!< 0x00000002 */
#define CAN_TXSTS_TXSUSFLG0                                         CAN_TXSTS_TXSUSFLG0_Msk                                        /*!<Transmission OK of Mailbox0 */
#define CAN_TXSTS_ARBLSTFLG0_Pos                                    (2U)
#define CAN_TXSTS_ARBLSTFLG0_Msk                                    (0x1UL << CAN_TXSTS_ARBLSTFLG0_Pos)                            /*!< 0x00000004 */
#define CAN_TXSTS_ARBLSTFLG0                                        CAN_TXSTS_ARBLSTFLG0_Msk                                       /*!<Arbitration Lost for Mailbox0 */
#define CAN_TXSTS_TXERRFLG0_Pos                                     (3U)
#define CAN_TXSTS_TXERRFLG0_Msk                                     (0x1UL << CAN_TXSTS_TXERRFLG0_Pos)                             /*!< 0x00000008 */
#define CAN_TXSTS_TXERRFLG0                                         CAN_TXSTS_TXERRFLG0_Msk                                        /*!<Transmission Error of Mailbox0 */
#define CAN_TXSTS_ABREQFLG0_Pos                                     (7U)
#define CAN_TXSTS_ABREQFLG0_Msk                                     (0x1UL << CAN_TXSTS_ABREQFLG0_Pos)                             /*!< 0x00000080 */
#define CAN_TXSTS_ABREQFLG0                                         CAN_TXSTS_ABREQFLG0_Msk                                        /*!<Abort Request for Mailbox0 */
#define CAN_TXSTS_REQCFLG1_Pos                                      (8U)
#define CAN_TXSTS_REQCFLG1_Msk                                      (0x1UL << CAN_TXSTS_REQCFLG1_Pos)                              /*!< 0x00000100 */
#define CAN_TXSTS_REQCFLG1                                          CAN_TXSTS_REQCFLG1_Msk                                         /*!<Request Completed Mailbox1 */
#define CAN_TXSTS_TXSUSFLG1_Pos                                     (9U)
#define CAN_TXSTS_TXSUSFLG1_Msk                                     (0x1UL << CAN_TXSTS_TXSUSFLG1_Pos)                             /*!< 0x00000200 */
#define CAN_TXSTS_TXSUSFLG1                                         CAN_TXSTS_TXSUSFLG1_Msk                                        /*!<Transmission OK of Mailbox1 */
#define CAN_TXSTS_ARBLSTFLG1_Pos                                    (10U)
#define CAN_TXSTS_ARBLSTFLG1_Msk                                    (0x1UL << CAN_TXSTS_ARBLSTFLG1_Pos)                            /*!< 0x00000400 */
#define CAN_TXSTS_ARBLSTFLG1                                        CAN_TXSTS_ARBLSTFLG1_Msk                                       /*!<Arbitration Lost for Mailbox1 */
#define CAN_TXSTS_TXERRFLG1_Pos                                     (11U)
#define CAN_TXSTS_TXERRFLG1_Msk                                     (0x1UL << CAN_TXSTS_TXERRFLG1_Pos)                             /*!< 0x00000800 */
#define CAN_TXSTS_TXERRFLG1                                         CAN_TXSTS_TXERRFLG1_Msk                                        /*!<Transmission Error of Mailbox1 */
#define CAN_TXSTS_ABREQFLG1_Pos                                     (15U)
#define CAN_TXSTS_ABREQFLG1_Msk                                     (0x1UL << CAN_TXSTS_ABREQFLG1_Pos)                             /*!< 0x00008000 */
#define CAN_TXSTS_ABREQFLG1                                         CAN_TXSTS_ABREQFLG1_Msk                                        /*!<Abort Request for Mailbox 1 */
#define CAN_TXSTS_REQCFLG2_Pos                                      (16U)
#define CAN_TXSTS_REQCFLG2_Msk                                      (0x1UL << CAN_TXSTS_REQCFLG2_Pos)                              /*!< 0x00010000 */
#define CAN_TXSTS_REQCFLG2                                          CAN_TXSTS_REQCFLG2_Msk                                         /*!<Request Completed Mailbox2 */
#define CAN_TXSTS_TXSUSFLG2_Pos                                     (17U)
#define CAN_TXSTS_TXSUSFLG2_Msk                                     (0x1UL << CAN_TXSTS_TXSUSFLG2_Pos)                             /*!< 0x00020000 */
#define CAN_TXSTS_TXSUSFLG2                                         CAN_TXSTS_TXSUSFLG2_Msk                                        /*!<Transmission OK of Mailbox 2 */
#define CAN_TXSTS_ARBLSTFLG2_Pos                                    (18U)
#define CAN_TXSTS_ARBLSTFLG2_Msk                                    (0x1UL << CAN_TXSTS_ARBLSTFLG2_Pos)                            /*!< 0x00040000 */
#define CAN_TXSTS_ARBLSTFLG2                                        CAN_TXSTS_ARBLSTFLG2_Msk                                       /*!<Arbitration Lost for mailbox 2 */
#define CAN_TXSTS_TXERRFLG2_Pos                                     (19U)
#define CAN_TXSTS_TXERRFLG2_Msk                                     (0x1UL << CAN_TXSTS_TXERRFLG2_Pos)                             /*!< 0x00080000 */
#define CAN_TXSTS_TXERRFLG2                                         CAN_TXSTS_TXERRFLG2_Msk                                        /*!<Transmission Error of Mailbox 2 */
#define CAN_TXSTS_ABREQFLG2_Pos                                     (23U)
#define CAN_TXSTS_ABREQFLG2_Msk                                     (0x1UL << CAN_TXSTS_ABREQFLG2_Pos)                             /*!< 0x00800000 */
#define CAN_TXSTS_ABREQFLG2                                         CAN_TXSTS_ABREQFLG2_Msk                                        /*!<Abort Request for Mailbox 2 */
#define CAN_TXSTS_EMNUM_Pos                                         (24U)
#define CAN_TXSTS_EMNUM_Msk                                         (0x3UL << CAN_TXSTS_EMNUM_Pos)                                 /*!< 0x03000000 */
#define CAN_TXSTS_EMNUM                                             CAN_TXSTS_EMNUM_Msk                                            /*!<Mailbox Code */

#define CAN_TXSTS_TXMEFLG_Pos                                       (26U)
#define CAN_TXSTS_TXMEFLG_Msk                                       (0x7UL << CAN_TXSTS_TXMEFLG_Pos)                               /*!< 0x1C000000 */
#define CAN_TXSTS_TXMEFLG                                           CAN_TXSTS_TXMEFLG_Msk                                          /*!<TME[2:0] bits */
#define CAN_TXSTS_TXMEFLG0_Pos                                      (26U)
#define CAN_TXSTS_TXMEFLG0_Msk                                      (0x1UL << CAN_TXSTS_TXMEFLG0_Pos)                              /*!< 0x04000000 */
#define CAN_TXSTS_TXMEFLG0                                          CAN_TXSTS_TXMEFLG0_Msk                                         /*!<Transmit Mailbox 0 Empty */
#define CAN_TXSTS_TXMEFLG1_Pos                                      (27U)
#define CAN_TXSTS_TXMEFLG1_Msk                                      (0x1UL << CAN_TXSTS_TXMEFLG1_Pos)                              /*!< 0x08000000 */
#define CAN_TXSTS_TXMEFLG1                                          CAN_TXSTS_TXMEFLG1_Msk                                         /*!<Transmit Mailbox 1 Empty */
#define CAN_TXSTS_TXMEFLG2_Pos                                      (28U)
#define CAN_TXSTS_TXMEFLG2_Msk                                      (0x1UL << CAN_TXSTS_TXMEFLG2_Pos)                              /*!< 0x10000000 */
#define CAN_TXSTS_TXMEFLG2                                          CAN_TXSTS_TXMEFLG2_Msk                                         /*!<Transmit Mailbox 2 Empty */

