betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
/********************  Bit definition for CRC_CTRL register  ********************/
#define CRC_CTRL_RST_Pos                                            (0U)
#define CRC_CTRL_RST_Msk                                            (0x1UL << CRC_CTRL_RST_Pos)                                    /*!< 0x00000001 */
#define CRC_CTRL_RST                                                CRC_CTRL_RST_Msk                                               /*!< RESET bit */

/******************************************************************************/
/*                                                                            */
/*                             DMA Controller                                 */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DMA_SCFGx register  *****************/
#define DMA_SCFGx_CHSEL_Pos                                         (25U)
#define DMA_SCFGx_CHSEL_Msk                                         (0x7UL << DMA_SCFGx_CHSEL_Pos)                                 /*!< 0x0E000000 */
#define DMA_SCFGx_CHSEL                                             DMA_SCFGx_CHSEL_Msk
#define DMA_SCFGx_CHSEL_0                                           0x02000000U
#define DMA_SCFGx_CHSEL_1                                           0x04000000U
#define DMA_SCFGx_CHSEL_2                                           0x08000000U
#define DMA_SCFGx_MBCFG_Pos                                         (23U)
#define DMA_SCFGx_MBCFG_Msk                                         (0x3UL << DMA_SCFGx_MBCFG_Pos)                                 /*!< 0x01800000 */
#define DMA_SCFGx_MBCFG                                             DMA_SCFGx_MBCFG_Msk
#define DMA_SCFGx_MBCFG_0                                           (0x1UL << DMA_SCFGx_MBCFG_Pos)                                 /*!< 0x00800000 */
#define DMA_SCFGx_MBCFG_1                                           (0x2UL << DMA_SCFGx_MBCFG_Pos)                                 /*!< 0x01000000 */
#define DMA_SCFGx_PBCFG_Pos                                         (21U)
#define DMA_SCFGx_PBCFG_Msk                                         (0x3UL << DMA_SCFGx_PBCFG_Pos)                                 /*!< 0x00600000 */
#define DMA_SCFGx_PBCFG                                             DMA_SCFGx_PBCFG_Msk
#define DMA_SCFGx_PBCFG_0                                           (0x1UL << DMA_SCFGx_PBCFG_Pos)                                 /*!< 0x00200000 */
#define DMA_SCFGx_PBCFG_1                                           (0x2UL << DMA_SCFGx_PBCFG_Pos)                                 /*!< 0x00400000 */
#define DMA_SCFGx_CTARG_Pos                                         (19U)
#define DMA_SCFGx_CTARG_Msk                                         (0x1UL << DMA_SCFGx_CTARG_Pos)                                 /*!< 0x00080000 */
#define DMA_SCFGx_CTARG                                             DMA_SCFGx_CTARG_Msk
#define DMA_SCFGx_DBM_Pos                                           (18U)
#define DMA_SCFGx_DBM_Msk                                           (0x1UL << DMA_SCFGx_DBM_Pos)                                   /*!< 0x00040000 */
#define DMA_SCFGx_DBM                                               DMA_SCFGx_DBM_Msk
#define DMA_SCFGx_PRILCFG_Pos                                       (16U)
#define DMA_SCFGx_PRILCFG_Msk                                       (0x3UL << DMA_SCFGx_PRILCFG_Pos)                               /*!< 0x00030000 */
#define DMA_SCFGx_PRILCFG                                           DMA_SCFGx_PRILCFG_Msk
#define DMA_SCFGx_PRILCFG_0                                         (0x1UL << DMA_SCFGx_PRILCFG_Pos)                               /*!< 0x00010000 */
#define DMA_SCFGx_PRILCFG_1                                         (0x2UL << DMA_SCFGx_PRILCFG_Pos)                               /*!< 0x00020000 */
#define DMA_SCFGx_PERIOSIZE_Pos                                     (15U)
#define DMA_SCFGx_PERIOSIZE_Msk                                     (0x1UL << DMA_SCFGx_PERIOSIZE_Pos)                             /*!< 0x00008000 */
#define DMA_SCFGx_PERIOSIZE                                         DMA_SCFGx_PERIOSIZE_Msk
#define DMA_SCFGx_MEMSIZECFG_Pos                                    (13U)
#define DMA_SCFGx_MEMSIZECFG_Msk                                    (0x3UL << DMA_SCFGx_MEMSIZECFG_Pos)                            /*!< 0x00006000 */
#define DMA_SCFGx_MEMSIZECFG                                        DMA_SCFGx_MEMSIZECFG_Msk
#define DMA_SCFGx_MEMSIZECFG_0                                      (0x1UL << DMA_SCFGx_MEMSIZECFG_Pos)                            /*!< 0x00002000 */
#define DMA_SCFGx_MEMSIZECFG_1                                      (0x2UL << DMA_SCFGx_MEMSIZECFG_Pos)                            /*!< 0x00004000 */
#define DMA_SCFGx_PERSIZECFG_Pos                                    (11U)
#define DMA_SCFGx_PERSIZECFG_Msk                                    (0x3UL << DMA_SCFGx_PERSIZECFG_Pos)                            /*!< 0x00001800 */
#define DMA_SCFGx_PERSIZECFG                                        DMA_SCFGx_PERSIZECFG_Msk
#define DMA_SCFGx_PERSIZECFG_0                                      (0x1UL << DMA_SCFGx_PERSIZECFG_Pos)                            /*!< 0x00000800 */
#define DMA_SCFGx_PERSIZECFG_1                                      (0x2UL << DMA_SCFGx_PERSIZECFG_Pos)                            /*!< 0x00001000 */
#define DMA_SCFGx_MEMIM_Pos                                         (10U)
#define DMA_SCFGx_MEMIM_Msk                                         (0x1UL << DMA_SCFGx_MEMIM_Pos)                                 /*!< 0x00000400 */
#define DMA_SCFGx_MEMIM                                             DMA_SCFGx_MEMIM_Msk
#define DMA_SCFGx_PERIM_Pos                                         (9U)
#define DMA_SCFGx_PERIM_Msk                                         (0x1UL << DMA_SCFGx_PERIM_Pos)                                 /*!< 0x00000200 */
#define DMA_SCFGx_PERIM                                             DMA_SCFGx_PERIM_Msk
#define DMA_SCFGx_CIRCMEN_Pos                                       (8U)
#define DMA_SCFGx_CIRCMEN_Msk                                       (0x1UL << DMA_SCFGx_CIRCMEN_Pos)                               /*!< 0x00000100 */
#define DMA_SCFGx_CIRCMEN                                           DMA_SCFGx_CIRCMEN_Msk
#define DMA_SCFGx_DIRCFG_Pos                                        (6U)
#define DMA_SCFGx_DIRCFG_Msk                                        (0x3UL << DMA_SCFGx_DIRCFG_Pos)                                /*!< 0x000000C0 */
#define DMA_SCFGx_DIRCFG                                            DMA_SCFGx_DIRCFG_Msk
#define DMA_SCFGx_DIRCFG_0                                          (0x1UL << DMA_SCFGx_DIRCFG_Pos)                                /*!< 0x00000040 */
#define DMA_SCFGx_DIRCFG_1                                          (0x2UL << DMA_SCFGx_DIRCFG_Pos)                                /*!< 0x00000080 */
#define DMA_SCFGx_PERFC_Pos                                         (5U)
#define DMA_SCFGx_PERFC_Msk                                         (0x1UL << DMA_SCFGx_PERFC_Pos)                                 /*!< 0x00000020 */
#define DMA_SCFGx_PERFC                                             DMA_SCFGx_PERFC_Msk
#define DMA_SCFGx_TXCIEN_Pos                                        (4U)
#define DMA_SCFGx_TXCIEN_Msk                                        (0x1UL << DMA_SCFGx_TXCIEN_Pos)                                /*!< 0x00000010 */
#define DMA_SCFGx_TXCIEN                                            DMA_SCFGx_TXCIEN_Msk
#define DMA_SCFGx_HTXIEN_Pos                                        (3U)
#define DMA_SCFGx_HTXIEN_Msk                                        (0x1UL << DMA_SCFGx_HTXIEN_Pos)                                /*!< 0x00000008 */
#define DMA_SCFGx_HTXIEN                                            DMA_SCFGx_HTXIEN_Msk
#define DMA_SCFGx_TXEIEN_Pos                                        (2U)
#define DMA_SCFGx_TXEIEN_Msk                                        (0x1UL << DMA_SCFGx_TXEIEN_Pos)                                /*!< 0x00000004 */
#define DMA_SCFGx_TXEIEN                                            DMA_SCFGx_TXEIEN_Msk
#define DMA_SCFGx_DMEIEN_Pos                                        (1U)
#define DMA_SCFGx_DMEIEN_Msk                                        (0x1UL << DMA_SCFGx_DMEIEN_Pos)                                /*!< 0x00000002 */
#define DMA_SCFGx_DMEIEN                                            DMA_SCFGx_DMEIEN_Msk
#define DMA_SCFGx_EN_Pos                                            (0U)
#define DMA_SCFGx_EN_Msk                                            (0x1UL << DMA_SCFGx_EN_Pos)                                    /*!< 0x00000001 */
#define DMA_SCFGx_EN                                                DMA_SCFGx_EN_Msk

