betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
/* Legacy defines */
#define DMA_SCFGx_ACK_Pos                                           (20U)
#define DMA_SCFGx_ACK_Msk                                           (0x1UL << DMA_SCFGx_ACK_Pos)                                   /*!< 0x00100000 */
#define DMA_SCFGx_ACK                                               DMA_SCFGx_ACK_Msk

/********************  Bits definition for DMA_NDATAx register  **************/
#define DMA_NDATAx_Pos                                              (0U)
#define DMA_NDATAx_Msk                                              (0xFFFFUL << DMA_NDATAx_Pos)                                   /*!< 0x0000FFFF */
#define DMA_NDATAx                                                  DMA_NDATAx_Msk
#define DMA_NDATAx_0                                                (0x0001UL << DMA_NDATAx_Pos)                                   /*!< 0x00000001 */
#define DMA_NDATAx_1                                                (0x0002UL << DMA_NDATAx_Pos)                                   /*!< 0x00000002 */
#define DMA_NDATAx_2                                                (0x0004UL << DMA_NDATAx_Pos)                                   /*!< 0x00000004 */
#define DMA_NDATAx_3                                                (0x0008UL << DMA_NDATAx_Pos)                                   /*!< 0x00000008 */
#define DMA_NDATAx_4                                                (0x0010UL << DMA_NDATAx_Pos)                                   /*!< 0x00000010 */
#define DMA_NDATAx_5                                                (0x0020UL << DMA_NDATAx_Pos)                                   /*!< 0x00000020 */
#define DMA_NDATAx_6                                                (0x0040UL << DMA_NDATAx_Pos)                                   /*!< 0x00000040 */
#define DMA_NDATAx_7                                                (0x0080UL << DMA_NDATAx_Pos)                                   /*!< 0x00000080 */
#define DMA_NDATAx_8                                                (0x0100UL << DMA_NDATAx_Pos)                                   /*!< 0x00000100 */
#define DMA_NDATAx_9                                                (0x0200UL << DMA_NDATAx_Pos)                                   /*!< 0x00000200 */
#define DMA_NDATAx_10                                               (0x0400UL << DMA_NDATAx_Pos)                                   /*!< 0x00000400 */
#define DMA_NDATAx_11                                               (0x0800UL << DMA_NDATAx_Pos)                                   /*!< 0x00000800 */
#define DMA_NDATAx_12                                               (0x1000UL << DMA_NDATAx_Pos)                                   /*!< 0x00001000 */
#define DMA_NDATAx_13                                               (0x2000UL << DMA_NDATAx_Pos)                                   /*!< 0x00002000 */
#define DMA_NDATAx_14                                               (0x4000UL << DMA_NDATAx_Pos)                                   /*!< 0x00004000 */
#define DMA_NDATAx_15                                               (0x8000UL << DMA_NDATAx_Pos)                                   /*!< 0x00008000 */

/********************  Bits definition for DMA_FCTRLx register  ****************/
#define DMA_FCTRLx_FEIEN_Pos                                        (7U)
#define DMA_FCTRLx_FEIEN_Msk                                        (0x1UL << DMA_FCTRLx_FEIEN_Pos)                                /*!< 0x00000080 */
#define DMA_FCTRLx_FEIEN                                            DMA_FCTRLx_FEIEN_Msk
#define DMA_FCTRLx_FSTS_Pos                                         (3U)
#define DMA_FCTRLx_FSTS_Msk                                         (0x7UL << DMA_FCTRLx_FSTS_Pos)                                 /*!< 0x00000038 */
#define DMA_FCTRLx_FSTS                                             DMA_FCTRLx_FSTS_Msk
#define DMA_FCTRLx_FSTS_0                                           (0x1UL << DMA_FCTRLx_FSTS_Pos)                                 /*!< 0x00000008 */
#define DMA_FCTRLx_FSTS_1                                           (0x2UL << DMA_FCTRLx_FSTS_Pos)                                 /*!< 0x00000010 */
#define DMA_FCTRLx_FSTS_2                                           (0x4UL << DMA_FCTRLx_FSTS_Pos)                                 /*!< 0x00000020 */
#define DMA_FCTRLx_DMDEN_Pos                                        (2U)
#define DMA_FCTRLx_DMDEN_Msk                                        (0x1UL << DMA_FCTRLx_DMDEN_Pos)                                /*!< 0x00000004 */
#define DMA_FCTRLx_DMDEN                                            DMA_FCTRLx_DMDEN_Msk
#define DMA_FCTRLx_FTHSEL_Pos                                       (0U)
#define DMA_FCTRLx_FTHSEL_Msk                                       (0x3UL << DMA_FCTRLx_FTHSEL_Pos)                               /*!< 0x00000003 */
#define DMA_FCTRLx_FTHSEL                                           DMA_FCTRLx_FTHSEL_Msk
#define DMA_FCTRLx_FTHSEL_0                                         (0x1UL << DMA_FCTRLx_FTHSEL_Pos)                               /*!< 0x00000001 */
#define DMA_FCTRLx_FTHSEL_1                                         (0x2UL << DMA_FCTRLx_FTHSEL_Pos)                               /*!< 0x00000002 */

/********************  Bits definition for DMA_LINTSTS register  *****************/
#define DMA_LINTSTS_TXCIFLG3_Pos                                    (27U)
#define DMA_LINTSTS_TXCIFLG3_Msk                                    (0x1UL << DMA_LINTSTS_TXCIFLG3_Pos)                            /*!< 0x08000000 */
#define DMA_LINTSTS_TXCIFLG3                                        DMA_LINTSTS_TXCIFLG3_Msk
#define DMA_LINTSTS_HTXIFLG3_Pos                                    (26U)
#define DMA_LINTSTS_HTXIFLG3_Msk                                    (0x1UL << DMA_LINTSTS_HTXIFLG3_Pos)                            /*!< 0x04000000 */
#define DMA_LINTSTS_HTXIFLG3                                        DMA_LINTSTS_HTXIFLG3_Msk
#define DMA_LINTSTS_TXEIFLG3_Pos                                    (25U)
#define DMA_LINTSTS_TXEIFLG3_Msk                                    (0x1UL << DMA_LINTSTS_TXEIFLG3_Pos)                            /*!< 0x02000000 */
#define DMA_LINTSTS_TXEIFLG3                                        DMA_LINTSTS_TXEIFLG3_Msk
#define DMA_LINTSTS_DMEIFLG3_Pos                                    (24U)
#define DMA_LINTSTS_DMEIFLG3_Msk                                    (0x1UL << DMA_LINTSTS_DMEIFLG3_Pos)                            /*!< 0x01000000 */
#define DMA_LINTSTS_DMEIFLG3                                        DMA_LINTSTS_DMEIFLG3_Msk
#define DMA_LINTSTS_FEIFLG3_Pos                                     (22U)
#define DMA_LINTSTS_FEIFLG3_Msk                                     (0x1UL << DMA_LINTSTS_FEIFLG3_Pos)                             /*!< 0x00400000 */
#define DMA_LINTSTS_FEIFLG3                                         DMA_LINTSTS_FEIFLG3_Msk
#define DMA_LINTSTS_TXCIFLG2_Pos                                    (21U)
#define DMA_LINTSTS_TXCIFLG2_Msk                                    (0x1UL << DMA_LINTSTS_TXCIFLG2_Pos)                            /*!< 0x00200000 */
#define DMA_LINTSTS_TXCIFLG2                                        DMA_LINTSTS_TXCIFLG2_Msk
#define DMA_LINTSTS_HTXIFLG2_Pos                                    (20U)
#define DMA_LINTSTS_HTXIFLG2_Msk                                    (0x1UL << DMA_LINTSTS_HTXIFLG2_Pos)                            /*!< 0x00100000 */
#define DMA_LINTSTS_HTXIFLG2                                        DMA_LINTSTS_HTXIFLG2_Msk
#define DMA_LINTSTS_TXEIFLG2_Pos                                    (19U)
#define DMA_LINTSTS_TXEIFLG2_Msk                                    (0x1UL << DMA_LINTSTS_TXEIFLG2_Pos)                            /*!< 0x00080000 */
#define DMA_LINTSTS_TXEIFLG2                                        DMA_LINTSTS_TXEIFLG2_Msk
#define DMA_LINTSTS_DMEIFLG2_Pos                                    (18U)
#define DMA_LINTSTS_DMEIFLG2_Msk                                    (0x1UL << DMA_LINTSTS_DMEIFLG2_Pos)                            /*!< 0x00040000 */
#define DMA_LINTSTS_DMEIFLG2                                        DMA_LINTSTS_DMEIFLG2_Msk
#define DMA_LINTSTS_FEIFLG2_Pos                                     (16U)
#define DMA_LINTSTS_FEIFLG2_Msk                                     (0x1UL << DMA_LINTSTS_FEIFLG2_Pos)                             /*!< 0x00010000 */
#define DMA_LINTSTS_FEIFLG2                                         DMA_LINTSTS_FEIFLG2_Msk
#define DMA_LINTSTS_TXCIFLG1_Pos                                    (11U)
#define DMA_LINTSTS_TXCIFLG1_Msk                                    (0x1UL << DMA_LINTSTS_TXCIFLG1_Pos)                            /*!< 0x00000800 */
#define DMA_LINTSTS_TXCIFLG1                                        DMA_LINTSTS_TXCIFLG1_Msk
#define DMA_LINTSTS_HTXIFLG1_Pos                                    (10U)
#define DMA_LINTSTS_HTXIFLG1_Msk                                    (0x1UL << DMA_LINTSTS_HTXIFLG1_Pos)                            /*!< 0x00000400 */
#define DMA_LINTSTS_HTXIFLG1                                        DMA_LINTSTS_HTXIFLG1_Msk
#define DMA_LINTSTS_TXEIFLG1_Pos                                    (9U)
#define DMA_LINTSTS_TXEIFLG1_Msk                                    (0x1UL << DMA_LINTSTS_TXEIFLG1_Pos)                            /*!< 0x00000200 */
#define DMA_LINTSTS_TXEIFLG1                                        DMA_LINTSTS_TXEIFLG1_Msk
#define DMA_LINTSTS_DMEIFLG1_Pos                                    (8U)
#define DMA_LINTSTS_DMEIFLG1_Msk                                    (0x1UL << DMA_LINTSTS_DMEIFLG1_Pos)                            /*!< 0x00000100 */
#define DMA_LINTSTS_DMEIFLG1                                        DMA_LINTSTS_DMEIFLG1_Msk
#define DMA_LINTSTS_FEIFLG1_Pos                                     (6U)
#define DMA_LINTSTS_FEIFLG1_Msk                                     (0x1UL << DMA_LINTSTS_FEIFLG1_Pos)                             /*!< 0x00000040 */
#define DMA_LINTSTS_FEIFLG1                                         DMA_LINTSTS_FEIFLG1_Msk
#define DMA_LINTSTS_TXCIFLG0_Pos                                    (5U)
#define DMA_LINTSTS_TXCIFLG0_Msk                                    (0x1UL << DMA_LINTSTS_TXCIFLG0_Pos)                            /*!< 0x00000020 */
#define DMA_LINTSTS_TXCIFLG0                                        DMA_LINTSTS_TXCIFLG0_Msk
#define DMA_LINTSTS_HTXIFLG0_Pos                                    (4U)
#define DMA_LINTSTS_HTXIFLG0_Msk                                    (0x1UL << DMA_LINTSTS_HTXIFLG0_Pos)                            /*!< 0x00000010 */
#define DMA_LINTSTS_HTXIFLG0                                        DMA_LINTSTS_HTXIFLG0_Msk
#define DMA_LINTSTS_TXEIFLG0_Pos                                    (3U)
#define DMA_LINTSTS_TXEIFLG0_Msk                                    (0x1UL << DMA_LINTSTS_TXEIFLG0_Pos)                            /*!< 0x00000008 */
#define DMA_LINTSTS_TXEIFLG0                                        DMA_LINTSTS_TXEIFLG0_Msk
#define DMA_LINTSTS_DMEIFLG0_Pos                                    (2U)
#define DMA_LINTSTS_DMEIFLG0_Msk                                    (0x1UL << DMA_LINTSTS_DMEIFLG0_Pos)                            /*!< 0x00000004 */
#define DMA_LINTSTS_DMEIFLG0                                        DMA_LINTSTS_DMEIFLG0_Msk
#define DMA_LINTSTS_FEIFLG0_Pos                                     (0U)
#define DMA_LINTSTS_FEIFLG0_Msk                                     (0x1UL << DMA_LINTSTS_FEIFLG0_Pos)                             /*!< 0x00000001 */
#define DMA_LINTSTS_FEIFLG0                                         DMA_LINTSTS_FEIFLG0_Msk

/********************  Bits definition for DMA_HINTSTS register  *****************/
#define DMA_HINTSTS_TXCIFLG7_Pos                                    (27U)
#define DMA_HINTSTS_TXCIFLG7_Msk                                    (0x1UL << DMA_HINTSTS_TXCIFLG7_Pos)                            /*!< 0x08000000 */
#define DMA_HINTSTS_TXCIFLG7                                        DMA_HINTSTS_TXCIFLG7_Msk
#define DMA_HINTSTS_HTXIFLG7_Pos                                    (26U)
#define DMA_HINTSTS_HTXIFLG7_Msk                                    (0x1UL << DMA_HINTSTS_HTXIFLG7_Pos)                            /*!< 0x04000000 */
#define DMA_HINTSTS_HTXIFLG7                                        DMA_HINTSTS_HTXIFLG7_Msk
#define DMA_HINTSTS_TXEIFLG7_Pos                                    (25U)
#define DMA_HINTSTS_TXEIFLG7_Msk                                    (0x1UL << DMA_HINTSTS_TXEIFLG7_Pos)                            /*!< 0x02000000 */
#define DMA_HINTSTS_TXEIFLG7                                        DMA_HINTSTS_TXEIFLG7_Msk
#define DMA_HINTSTS_DMEIFLG7_Pos                                    (24U)
#define DMA_HINTSTS_DMEIFLG7_Msk                                    (0x1UL << DMA_HINTSTS_DMEIFLG7_Pos)                            /*!< 0x01000000 */
#define DMA_HINTSTS_DMEIFLG7                                        DMA_HINTSTS_DMEIFLG7_Msk
#define DMA_HINTSTS_FEIFLG7_Pos                                     (22U)
#define DMA_HINTSTS_FEIFLG7_Msk                                     (0x1UL << DMA_HINTSTS_FEIFLG7_Pos)                             /*!< 0x00400000 */
#define DMA_HINTSTS_FEIFLG7                                         DMA_HINTSTS_FEIFLG7_Msk
#define DMA_HINTSTS_TXCIFLG6_Pos                                    (21U)
#define DMA_HINTSTS_TXCIFLG6_Msk                                    (0x1UL << DMA_HINTSTS_TXCIFLG6_Pos)                            /*!< 0x00200000 */
#define DMA_HINTSTS_TXCIFLG6                                        DMA_HINTSTS_TXCIFLG6_Msk
#define DMA_HINTSTS_HTXIFLG6_Pos                                    (20U)
#define DMA_HINTSTS_HTXIFLG6_Msk                                    (0x1UL << DMA_HINTSTS_HTXIFLG6_Pos)                            /*!< 0x00100000 */
#define DMA_HINTSTS_HTXIFLG6                                        DMA_HINTSTS_HTXIFLG6_Msk
#define DMA_HINTSTS_TXEIFLG6_Pos                                    (19U)
#define DMA_HINTSTS_TXEIFLG6_Msk                                    (0x1UL << DMA_HINTSTS_TXEIFLG6_Pos)                            /*!< 0x00080000 */
#define DMA_HINTSTS_TXEIFLG6                                        DMA_HINTSTS_TXEIFLG6_Msk
#define DMA_HINTSTS_DMEIFLG6_Pos                                    (18U)
#define DMA_HINTSTS_DMEIFLG6_Msk                                    (0x1UL << DMA_HINTSTS_DMEIFLG6_Pos)                            /*!< 0x00040000 */
#define DMA_HINTSTS_DMEIFLG6                                        DMA_HINTSTS_DMEIFLG6_Msk
#define DMA_HINTSTS_FEIFLG6_Pos                                     (16U)
#define DMA_HINTSTS_FEIFLG6_Msk                                     (0x1UL << DMA_HINTSTS_FEIFLG6_Pos)                             /*!< 0x00010000 */
#define DMA_HINTSTS_FEIFLG6                                         DMA_HINTSTS_FEIFLG6_Msk
#define DMA_HINTSTS_TXCIFLG5_Pos                                    (11U)
#define DMA_HINTSTS_TXCIFLG5_Msk                                    (0x1UL << DMA_HINTSTS_TXCIFLG5_Pos)                            /*!< 0x00000800 */
#define DMA_HINTSTS_TXCIFLG5                                        DMA_HINTSTS_TXCIFLG5_Msk
#define DMA_HINTSTS_HTXIFLG5_Pos                                    (10U)
#define DMA_HINTSTS_HTXIFLG5_Msk                                    (0x1UL << DMA_HINTSTS_HTXIFLG5_Pos)                            /*!< 0x00000400 */
#define DMA_HINTSTS_HTXIFLG5                                        DMA_HINTSTS_HTXIFLG5_Msk
#define DMA_HINTSTS_TXEIFLG5_Pos                                    (9U)
#define DMA_HINTSTS_TXEIFLG5_Msk                                    (0x1UL << DMA_HINTSTS_TXEIFLG5_Pos)                            /*!< 0x00000200 */
#define DMA_HINTSTS_TXEIFLG5                                        DMA_HINTSTS_TXEIFLG5_Msk
#define DMA_HINTSTS_DMEIFLG5_Pos                                    (8U)
#define DMA_HINTSTS_DMEIFLG5_Msk                                    (0x1UL << DMA_HINTSTS_DMEIFLG5_Pos)                            /*!< 0x00000100 */
#define DMA_HINTSTS_DMEIFLG5                                        DMA_HINTSTS_DMEIFLG5_Msk
#define DMA_HINTSTS_FEIFLG5_Pos                                     (6U)
#define DMA_HINTSTS_FEIFLG5_Msk                                     (0x1UL << DMA_HINTSTS_FEIFLG5_Pos)                             /*!< 0x00000040 */
#define DMA_HINTSTS_FEIFLG5                                         DMA_HINTSTS_FEIFLG5_Msk
#define DMA_HINTSTS_TXCIFLG4_Pos                                    (5U)
#define DMA_HINTSTS_TXCIFLG4_Msk                                    (0x1UL << DMA_HINTSTS_TXCIFLG4_Pos)                            /*!< 0x00000020 */
#define DMA_HINTSTS_TXCIFLG4                                        DMA_HINTSTS_TXCIFLG4_Msk
#define DMA_HINTSTS_HTXIFLG4_Pos                                    (4U)
#define DMA_HINTSTS_HTXIFLG4_Msk                                    (0x1UL << DMA_HINTSTS_HTXIFLG4_Pos)                            /*!< 0x00000010 */
#define DMA_HINTSTS_HTXIFLG4                                        DMA_HINTSTS_HTXIFLG4_Msk
#define DMA_HINTSTS_TXEIFLG4_Pos                                    (3U)
#define DMA_HINTSTS_TXEIFLG4_Msk                                    (0x1UL << DMA_HINTSTS_TXEIFLG4_Pos)                            /*!< 0x00000008 */
#define DMA_HINTSTS_TXEIFLG4                                        DMA_HINTSTS_TXEIFLG4_Msk
#define DMA_HINTSTS_DMEIFLG4_Pos                                    (2U)
#define DMA_HINTSTS_DMEIFLG4_Msk                                    (0x1UL << DMA_HINTSTS_DMEIFLG4_Pos)                            /*!< 0x00000004 */
#define DMA_HINTSTS_DMEIFLG4                                        DMA_HINTSTS_DMEIFLG4_Msk
#define DMA_HINTSTS_FEIFLG4_Pos                                     (0U)
#define DMA_HINTSTS_FEIFLG4_Msk                                     (0x1UL << DMA_HINTSTS_FEIFLG4_Pos)                             /*!< 0x00000001 */
#define DMA_HINTSTS_FEIFLG4                                         DMA_HINTSTS_FEIFLG4_Msk

