betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
/*******************  Bit definition for EINT_EMASK register  *******************/
#define EINT_EMASK_EMASK0_Pos                                       (0U)
#define EINT_EMASK_EMASK0_Msk                                       (0x1UL << EINT_EMASK_EMASK0_Pos)                               /*!< 0x00000001 */
#define EINT_EMASK_EMASK0                                           EINT_EMASK_EMASK0_Msk                                          /*!< Event Mask on line 0 */
#define EINT_EMASK_EMASK1_Pos                                       (1U)
#define EINT_EMASK_EMASK1_Msk                                       (0x1UL << EINT_EMASK_EMASK1_Pos)                               /*!< 0x00000002 */
#define EINT_EMASK_EMASK1                                           EINT_EMASK_EMASK1_Msk                                          /*!< Event Mask on line 1 */
#define EINT_EMASK_EMASK2_Pos                                       (2U)
#define EINT_EMASK_EMASK2_Msk                                       (0x1UL << EINT_EMASK_EMASK2_Pos)                               /*!< 0x00000004 */
#define EINT_EMASK_EMASK2                                           EINT_EMASK_EMASK2_Msk                                          /*!< Event Mask on line 2 */
#define EINT_EMASK_EMASK3_Pos                                       (3U)
#define EINT_EMASK_EMASK3_Msk                                       (0x1UL << EINT_EMASK_EMASK3_Pos)                               /*!< 0x00000008 */
#define EINT_EMASK_EMASK3                                           EINT_EMASK_EMASK3_Msk                                          /*!< Event Mask on line 3 */
#define EINT_EMASK_EMASK4_Pos                                       (4U)
#define EINT_EMASK_EMASK4_Msk                                       (0x1UL << EINT_EMASK_EMASK4_Pos)                               /*!< 0x00000010 */
#define EINT_EMASK_EMASK4                                           EINT_EMASK_EMASK4_Msk                                          /*!< Event Mask on line 4 */
#define EINT_EMASK_EMASK5_Pos                                       (5U)
#define EINT_EMASK_EMASK5_Msk                                       (0x1UL << EINT_EMASK_EMASK5_Pos)                               /*!< 0x00000020 */
#define EINT_EMASK_EMASK5                                           EINT_EMASK_EMASK5_Msk                                          /*!< Event Mask on line 5 */
#define EINT_EMASK_EMASK6_Pos                                       (6U)
#define EINT_EMASK_EMASK6_Msk                                       (0x1UL << EINT_EMASK_EMASK6_Pos)                               /*!< 0x00000040 */
#define EINT_EMASK_EMASK6                                           EINT_EMASK_EMASK6_Msk                                          /*!< Event Mask on line 6 */
#define EINT_EMASK_EMASK7_Pos                                       (7U)
#define EINT_EMASK_EMASK7_Msk                                       (0x1UL << EINT_EMASK_EMASK7_Pos)                               /*!< 0x00000080 */
#define EINT_EMASK_EMASK7                                           EINT_EMASK_EMASK7_Msk                                          /*!< Event Mask on line 7 */
#define EINT_EMASK_EMASK8_Pos                                       (8U)
#define EINT_EMASK_EMASK8_Msk                                       (0x1UL << EINT_EMASK_EMASK8_Pos)                               /*!< 0x00000100 */
#define EINT_EMASK_EMASK8                                           EINT_EMASK_EMASK8_Msk                                          /*!< Event Mask on line 8 */
#define EINT_EMASK_EMASK9_Pos                                       (9U)
#define EINT_EMASK_EMASK9_Msk                                       (0x1UL << EINT_EMASK_EMASK9_Pos)                               /*!< 0x00000200 */
#define EINT_EMASK_EMASK9                                           EINT_EMASK_EMASK9_Msk                                          /*!< Event Mask on line 9 */
#define EINT_EMASK_EMASK10_Pos                                      (10U)
#define EINT_EMASK_EMASK10_Msk                                      (0x1UL << EINT_EMASK_EMASK10_Pos)                              /*!< 0x00000400 */
#define EINT_EMASK_EMASK10                                          EINT_EMASK_EMASK10_Msk                                         /*!< Event Mask on line 10 */
#define EINT_EMASK_EMASK11_Pos                                      (11U)
#define EINT_EMASK_EMASK11_Msk                                      (0x1UL << EINT_EMASK_EMASK11_Pos)                              /*!< 0x00000800 */
#define EINT_EMASK_EMASK11                                          EINT_EMASK_EMASK11_Msk                                         /*!< Event Mask on line 11 */
#define EINT_EMASK_EMASK12_Pos                                      (12U)
#define EINT_EMASK_EMASK12_Msk                                      (0x1UL << EINT_EMASK_EMASK12_Pos)                              /*!< 0x00001000 */
#define EINT_EMASK_EMASK12                                          EINT_EMASK_EMASK12_Msk                                         /*!< Event Mask on line 12 */
#define EINT_EMASK_EMASK13_Pos                                      (13U)
#define EINT_EMASK_EMASK13_Msk                                      (0x1UL << EINT_EMASK_EMASK13_Pos)                              /*!< 0x00002000 */
#define EINT_EMASK_EMASK13                                          EINT_EMASK_EMASK13_Msk                                         /*!< Event Mask on line 13 */
#define EINT_EMASK_EMASK14_Pos                                      (14U)
#define EINT_EMASK_EMASK14_Msk                                      (0x1UL << EINT_EMASK_EMASK14_Pos)                              /*!< 0x00004000 */
#define EINT_EMASK_EMASK14                                          EINT_EMASK_EMASK14_Msk                                         /*!< Event Mask on line 14 */
#define EINT_EMASK_EMASK15_Pos                                      (15U)
#define EINT_EMASK_EMASK15_Msk                                      (0x1UL << EINT_EMASK_EMASK15_Pos)                              /*!< 0x00008000 */
#define EINT_EMASK_EMASK15                                          EINT_EMASK_EMASK15_Msk                                         /*!< Event Mask on line 15 */
#define EINT_EMASK_EMASK16_Pos                                      (16U)
#define EINT_EMASK_EMASK16_Msk                                      (0x1UL << EINT_EMASK_EMASK16_Pos)                              /*!< 0x00010000 */
#define EINT_EMASK_EMASK16                                          EINT_EMASK_EMASK16_Msk                                         /*!< Event Mask on line 16 */
#define EINT_EMASK_EMASK17_Pos                                      (17U)
#define EINT_EMASK_EMASK17_Msk                                      (0x1UL << EINT_EMASK_EMASK17_Pos)                              /*!< 0x00020000 */
#define EINT_EMASK_EMASK17                                          EINT_EMASK_EMASK17_Msk                                         /*!< Event Mask on line 17 */
#define EINT_EMASK_EMASK18_Pos                                      (18U)
#define EINT_EMASK_EMASK18_Msk                                      (0x1UL << EINT_EMASK_EMASK18_Pos)                              /*!< 0x00040000 */
#define EINT_EMASK_EMASK18                                          EINT_EMASK_EMASK18_Msk                                         /*!< Event Mask on line 18 */
#define EINT_EMASK_EMASK19_Pos                                      (19U)
#define EINT_EMASK_EMASK19_Msk                                      (0x1UL << EINT_EMASK_EMASK19_Pos)                              /*!< 0x00080000 */
#define EINT_EMASK_EMASK19                                          EINT_EMASK_EMASK19_Msk                                         /*!< Event Mask on line 19 */
#define EINT_EMASK_EMASK20_Pos                                      (20U)
#define EINT_EMASK_EMASK20_Msk                                      (0x1UL << EINT_EMASK_EMASK20_Pos)                              /*!< 0x00100000 */
#define EINT_EMASK_EMASK20                                          EINT_EMASK_EMASK20_Msk                                         /*!< Event Mask on line 20 */
#define EINT_EMASK_EMASK21_Pos                                      (21U)
#define EINT_EMASK_EMASK21_Msk                                      (0x1UL << EINT_EMASK_EMASK21_Pos)                              /*!< 0x00200000 */
#define EINT_EMASK_EMASK21                                          EINT_EMASK_EMASK21_Msk                                         /*!< Event Mask on line 21 */
#define EINT_EMASK_EMASK22_Pos                                      (22U)
#define EINT_EMASK_EMASK22_Msk                                      (0x1UL << EINT_EMASK_EMASK22_Pos)                              /*!< 0x00400000 */
#define EINT_EMASK_EMASK22                                          EINT_EMASK_EMASK22_Msk                                         /*!< Event Mask on line 22 */

/* Reference Defines */
#define EINT_EMASK_EM0                                              EINT_EMASK_EMASK0
#define EINT_EMASK_EM1                                              EINT_EMASK_EMASK1
#define EINT_EMASK_EM2                                              EINT_EMASK_EMASK2
#define EINT_EMASK_EM3                                              EINT_EMASK_EMASK3
#define EINT_EMASK_EM4                                              EINT_EMASK_EMASK4
#define EINT_EMASK_EM5                                              EINT_EMASK_EMASK5
#define EINT_EMASK_EM6                                              EINT_EMASK_EMASK6
#define EINT_EMASK_EM7                                              EINT_EMASK_EMASK7
#define EINT_EMASK_EM8                                              EINT_EMASK_EMASK8
#define EINT_EMASK_EM9                                              EINT_EMASK_EMASK9
#define EINT_EMASK_EM10                                             EINT_EMASK_EMASK10
#define EINT_EMASK_EM11                                             EINT_EMASK_EMASK11
#define EINT_EMASK_EM12                                             EINT_EMASK_EMASK12
#define EINT_EMASK_EM13                                             EINT_EMASK_EMASK13
#define EINT_EMASK_EM14                                             EINT_EMASK_EMASK14
#define EINT_EMASK_EM15                                             EINT_EMASK_EMASK15
#define EINT_EMASK_EM16                                             EINT_EMASK_EMASK16
#define EINT_EMASK_EM17                                             EINT_EMASK_EMASK17
#define EINT_EMASK_EM18                                             EINT_EMASK_EMASK18
#define EINT_EMASK_EM19                                             EINT_EMASK_EMASK19
#define EINT_EMASK_EM20                                             EINT_EMASK_EMASK20
#define EINT_EMASK_EM21                                             EINT_EMASK_EMASK21
#define EINT_EMASK_EM22                                             EINT_EMASK_EMASK22

/******************  Bit definition for EINT_RTEN register  *******************/
#define EINT_RTEN_RTEN0_Pos                                         (0U)
#define EINT_RTEN_RTEN0_Msk                                         (0x1UL << EINT_RTEN_RTEN0_Pos)                                 /*!< 0x00000001 */
#define EINT_RTEN_RTEN0                                             EINT_RTEN_RTEN0_Msk                                            /*!< Rising trigger event configuration bit of line 0 */
#define EINT_RTEN_RTEN1_Pos                                         (1U)
#define EINT_RTEN_RTEN1_Msk                                         (0x1UL << EINT_RTEN_RTEN1_Pos)                                 /*!< 0x00000002 */
#define EINT_RTEN_RTEN1                                             EINT_RTEN_RTEN1_Msk                                            /*!< Rising trigger event configuration bit of line 1 */
#define EINT_RTEN_RTEN2_Pos                                         (2U)
#define EINT_RTEN_RTEN2_Msk                                         (0x1UL << EINT_RTEN_RTEN2_Pos)                                 /*!< 0x00000004 */
#define EINT_RTEN_RTEN2                                             EINT_RTEN_RTEN2_Msk                                            /*!< Rising trigger event configuration bit of line 2 */
#define EINT_RTEN_RTEN3_Pos                                         (3U)
#define EINT_RTEN_RTEN3_Msk                                         (0x1UL << EINT_RTEN_RTEN3_Pos)                                 /*!< 0x00000008 */
#define EINT_RTEN_RTEN3                                             EINT_RTEN_RTEN3_Msk                                            /*!< Rising trigger event configuration bit of line 3 */
#define EINT_RTEN_RTEN4_Pos                                         (4U)
#define EINT_RTEN_RTEN4_Msk                                         (0x1UL << EINT_RTEN_RTEN4_Pos)                                 /*!< 0x00000010 */
#define EINT_RTEN_RTEN4                                             EINT_RTEN_RTEN4_Msk                                            /*!< Rising trigger event configuration bit of line 4 */
#define EINT_RTEN_RTEN5_Pos                                         (5U)
#define EINT_RTEN_RTEN5_Msk                                         (0x1UL << EINT_RTEN_RTEN5_Pos)                                 /*!< 0x00000020 */
#define EINT_RTEN_RTEN5                                             EINT_RTEN_RTEN5_Msk                                            /*!< Rising trigger event configuration bit of line 5 */
#define EINT_RTEN_RTEN6_Pos                                         (6U)
#define EINT_RTEN_RTEN6_Msk                                         (0x1UL << EINT_RTEN_RTEN6_Pos)                                 /*!< 0x00000040 */
#define EINT_RTEN_RTEN6                                             EINT_RTEN_RTEN6_Msk                                            /*!< Rising trigger event configuration bit of line 6 */
#define EINT_RTEN_RTEN7_Pos                                         (7U)
#define EINT_RTEN_RTEN7_Msk                                         (0x1UL << EINT_RTEN_RTEN7_Pos)                                 /*!< 0x00000080 */
#define EINT_RTEN_RTEN7                                             EINT_RTEN_RTEN7_Msk                                            /*!< Rising trigger event configuration bit of line 7 */
#define EINT_RTEN_RTEN8_Pos                                         (8U)
#define EINT_RTEN_RTEN8_Msk                                         (0x1UL << EINT_RTEN_RTEN8_Pos)                                 /*!< 0x00000100 */
#define EINT_RTEN_RTEN8                                             EINT_RTEN_RTEN8_Msk                                            /*!< Rising trigger event configuration bit of line 8 */
#define EINT_RTEN_RTEN9_Pos                                         (9U)
#define EINT_RTEN_RTEN9_Msk                                         (0x1UL << EINT_RTEN_RTEN9_Pos)                                 /*!< 0x00000200 */
#define EINT_RTEN_RTEN9                                             EINT_RTEN_RTEN9_Msk                                            /*!< Rising trigger event configuration bit of line 9 */
#define EINT_RTEN_RTEN10_Pos                                        (10U)
#define EINT_RTEN_RTEN10_Msk                                        (0x1UL << EINT_RTEN_RTEN10_Pos)                                /*!< 0x00000400 */
#define EINT_RTEN_RTEN10                                            EINT_RTEN_RTEN10_Msk                                           /*!< Rising trigger event configuration bit of line 10 */
#define EINT_RTEN_RTEN11_Pos                                        (11U)
#define EINT_RTEN_RTEN11_Msk                                        (0x1UL << EINT_RTEN_RTEN11_Pos)                                /*!< 0x00000800 */
#define EINT_RTEN_RTEN11                                            EINT_RTEN_RTEN11_Msk                                           /*!< Rising trigger event configuration bit of line 11 */
#define EINT_RTEN_RTEN12_Pos                                        (12U)
#define EINT_RTEN_RTEN12_Msk                                        (0x1UL << EINT_RTEN_RTEN12_Pos)                                /*!< 0x00001000 */
#define EINT_RTEN_RTEN12                                            EINT_RTEN_RTEN12_Msk                                           /*!< Rising trigger event configuration bit of line 12 */
#define EINT_RTEN_RTEN13_Pos                                        (13U)
#define EINT_RTEN_RTEN13_Msk                                        (0x1UL << EINT_RTEN_RTEN13_Pos)                                /*!< 0x00002000 */
#define EINT_RTEN_RTEN13                                            EINT_RTEN_RTEN13_Msk                                           /*!< Rising trigger event configuration bit of line 13 */
#define EINT_RTEN_RTEN14_Pos                                        (14U)
#define EINT_RTEN_RTEN14_Msk                                        (0x1UL << EINT_RTEN_RTEN14_Pos)                                /*!< 0x00004000 */
#define EINT_RTEN_RTEN14                                            EINT_RTEN_RTEN14_Msk                                           /*!< Rising trigger event configuration bit of line 14 */
#define EINT_RTEN_RTEN15_Pos                                        (15U)
#define EINT_RTEN_RTEN15_Msk                                        (0x1UL << EINT_RTEN_RTEN15_Pos)                                /*!< 0x00008000 */
#define EINT_RTEN_RTEN15                                            EINT_RTEN_RTEN15_Msk                                           /*!< Rising trigger event configuration bit of line 15 */
#define EINT_RTEN_RTEN16_Pos                                        (16U)
#define EINT_RTEN_RTEN16_Msk                                        (0x1UL << EINT_RTEN_RTEN16_Pos)                                /*!< 0x00010000 */
#define EINT_RTEN_RTEN16                                            EINT_RTEN_RTEN16_Msk                                           /*!< Rising trigger event configuration bit of line 16 */
#define EINT_RTEN_RTEN17_Pos                                        (17U)
#define EINT_RTEN_RTEN17_Msk                                        (0x1UL << EINT_RTEN_RTEN17_Pos)                                /*!< 0x00020000 */
#define EINT_RTEN_RTEN17                                            EINT_RTEN_RTEN17_Msk                                           /*!< Rising trigger event configuration bit of line 17 */
#define EINT_RTEN_RTEN18_Pos                                        (18U)
#define EINT_RTEN_RTEN18_Msk                                        (0x1UL << EINT_RTEN_RTEN18_Pos)                                /*!< 0x00040000 */
#define EINT_RTEN_RTEN18                                            EINT_RTEN_RTEN18_Msk                                           /*!< Rising trigger event configuration bit of line 18 */
#define EINT_RTEN_RTEN19_Pos                                        (19U)
#define EINT_RTEN_RTEN19_Msk                                        (0x1UL << EINT_RTEN_RTEN19_Pos)                                /*!< 0x00080000 */
#define EINT_RTEN_RTEN19                                            EINT_RTEN_RTEN19_Msk                                           /*!< Rising trigger event configuration bit of line 19 */
#define EINT_RTEN_RTEN20_Pos                                        (20U)
#define EINT_RTEN_RTEN20_Msk                                        (0x1UL << EINT_RTEN_RTEN20_Pos)                                /*!< 0x00100000 */
#define EINT_RTEN_RTEN20                                            EINT_RTEN_RTEN20_Msk                                           /*!< Rising trigger event configuration bit of line 20 */
#define EINT_RTEN_RTEN21_Pos                                        (21U)
#define EINT_RTEN_RTEN21_Msk                                        (0x1UL << EINT_RTEN_RTEN21_Pos)                                /*!< 0x00200000 */
#define EINT_RTEN_RTEN21                                            EINT_RTEN_RTEN21_Msk                                           /*!< Rising trigger event configuration bit of line 21 */
#define EINT_RTEN_RTEN22_Pos                                        (22U)
#define EINT_RTEN_RTEN22_Msk                                        (0x1UL << EINT_RTEN_RTEN22_Pos)                                /*!< 0x00400000 */
#define EINT_RTEN_RTEN22                                            EINT_RTEN_RTEN22_Msk                                           /*!< Rising trigger event configuration bit of line 22 */

