betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
#define SMC_AMSTIM3_HLD3_Pos                                        (16U)
#define SMC_AMSTIM3_HLD3_Msk                                        (0xFFUL << SMC_AMSTIM3_HLD3_Pos)                               /*!< 0x00FF0000 */
#define SMC_AMSTIM3_HLD3                                            SMC_AMSTIM3_HLD3_Msk                                           /*!<ATTHOLD3[7:0] bits (Attribute memory 3 hold time) */
#define SMC_AMSTIM3_HLD3_0                                          (0x01UL << SMC_AMSTIM3_HLD3_Pos)                               /*!< 0x00010000 */
#define SMC_AMSTIM3_HLD3_1                                          (0x02UL << SMC_AMSTIM3_HLD3_Pos)                               /*!< 0x00020000 */
#define SMC_AMSTIM3_HLD3_2                                          (0x04UL << SMC_AMSTIM3_HLD3_Pos)                               /*!< 0x00040000 */
#define SMC_AMSTIM3_HLD3_3                                          (0x08UL << SMC_AMSTIM3_HLD3_Pos)                               /*!< 0x00080000 */
#define SMC_AMSTIM3_HLD3_4                                          (0x10UL << SMC_AMSTIM3_HLD3_Pos)                               /*!< 0x00100000 */
#define SMC_AMSTIM3_HLD3_5                                          (0x20UL << SMC_AMSTIM3_HLD3_Pos)                               /*!< 0x00200000 */
#define SMC_AMSTIM3_HLD3_6                                          (0x40UL << SMC_AMSTIM3_HLD3_Pos)                               /*!< 0x00400000 */
#define SMC_AMSTIM3_HLD3_7                                          (0x80UL << SMC_AMSTIM3_HLD3_Pos)                               /*!< 0x00800000 */

#define SMC_AMSTIM3_HIZ3_Pos                                        (24U)
#define SMC_AMSTIM3_HIZ3_Msk                                        (0xFFUL << SMC_AMSTIM3_HIZ3_Pos)                               /*!< 0xFF000000 */
#define SMC_AMSTIM3_HIZ3                                            SMC_AMSTIM3_HIZ3_Msk                                           /*!<ATTHIZ3[7:0] bits (Attribute memory 3 databus HiZ time) */
#define SMC_AMSTIM3_HIZ3_0                                          (0x01UL << SMC_AMSTIM3_HIZ3_Pos)                               /*!< 0x01000000 */
#define SMC_AMSTIM3_HIZ3_1                                          (0x02UL << SMC_AMSTIM3_HIZ3_Pos)                               /*!< 0x02000000 */
#define SMC_AMSTIM3_HIZ3_2                                          (0x04UL << SMC_AMSTIM3_HIZ3_Pos)                               /*!< 0x04000000 */
#define SMC_AMSTIM3_HIZ3_3                                          (0x08UL << SMC_AMSTIM3_HIZ3_Pos)                               /*!< 0x08000000 */
#define SMC_AMSTIM3_HIZ3_4                                          (0x10UL << SMC_AMSTIM3_HIZ3_Pos)                               /*!< 0x10000000 */
#define SMC_AMSTIM3_HIZ3_5                                          (0x20UL << SMC_AMSTIM3_HIZ3_Pos)                               /*!< 0x20000000 */
#define SMC_AMSTIM3_HIZ3_6                                          (0x40UL << SMC_AMSTIM3_HIZ3_Pos)                               /*!< 0x40000000 */
#define SMC_AMSTIM3_HIZ3_7                                          (0x80UL << SMC_AMSTIM3_HIZ3_Pos)                               /*!< 0x80000000 */

/******************  Bit definition for SMC_AMSTIM4 register  ******************/
#define SMC_AMSTIM4_SET4_Pos                                        (0U)
#define SMC_AMSTIM4_SET4_Msk                                        (0xFFUL << SMC_AMSTIM4_SET4_Pos)                               /*!< 0x000000FF */
#define SMC_AMSTIM4_SET4                                            SMC_AMSTIM4_SET4_Msk                                           /*!<ATTSET4[7:0] bits (Attribute memory 4 setup time) */
#define SMC_AMSTIM4_SET4_0                                          (0x01UL << SMC_AMSTIM4_SET4_Pos)                               /*!< 0x00000001 */
#define SMC_AMSTIM4_SET4_1                                          (0x02UL << SMC_AMSTIM4_SET4_Pos)                               /*!< 0x00000002 */
#define SMC_AMSTIM4_SET4_2                                          (0x04UL << SMC_AMSTIM4_SET4_Pos)                               /*!< 0x00000004 */
#define SMC_AMSTIM4_SET4_3                                          (0x08UL << SMC_AMSTIM4_SET4_Pos)                               /*!< 0x00000008 */
#define SMC_AMSTIM4_SET4_4                                          (0x10UL << SMC_AMSTIM4_SET4_Pos)                               /*!< 0x00000010 */
#define SMC_AMSTIM4_SET4_5                                          (0x20UL << SMC_AMSTIM4_SET4_Pos)                               /*!< 0x00000020 */
#define SMC_AMSTIM4_SET4_6                                          (0x40UL << SMC_AMSTIM4_SET4_Pos)                               /*!< 0x00000040 */
#define SMC_AMSTIM4_SET4_7                                          (0x80UL << SMC_AMSTIM4_SET4_Pos)                               /*!< 0x00000080 */

#define SMC_AMSTIM4_WAIT4_Pos                                       (8U)
#define SMC_AMSTIM4_WAIT4_Msk                                       (0xFFUL << SMC_AMSTIM4_WAIT4_Pos)                              /*!< 0x0000FF00 */
#define SMC_AMSTIM4_WAIT4                                           SMC_AMSTIM4_WAIT4_Msk                                          /*!<ATTWAIT4[7:0] bits (Attribute memory 4 wait time) */
#define SMC_AMSTIM4_WAIT4_0                                         (0x01UL << SMC_AMSTIM4_WAIT4_Pos)                              /*!< 0x00000100 */
#define SMC_AMSTIM4_WAIT4_1                                         (0x02UL << SMC_AMSTIM4_WAIT4_Pos)                              /*!< 0x00000200 */
#define SMC_AMSTIM4_WAIT4_2                                         (0x04UL << SMC_AMSTIM4_WAIT4_Pos)                              /*!< 0x00000400 */
#define SMC_AMSTIM4_WAIT4_3                                         (0x08UL << SMC_AMSTIM4_WAIT4_Pos)                              /*!< 0x00000800 */
#define SMC_AMSTIM4_WAIT4_4                                         (0x10UL << SMC_AMSTIM4_WAIT4_Pos)                              /*!< 0x00001000 */
#define SMC_AMSTIM4_WAIT4_5                                         (0x20UL << SMC_AMSTIM4_WAIT4_Pos)                              /*!< 0x00002000 */
#define SMC_AMSTIM4_WAIT4_6                                         (0x40UL << SMC_AMSTIM4_WAIT4_Pos)                              /*!< 0x00004000 */
#define SMC_AMSTIM4_WAIT4_7                                         (0x80UL << SMC_AMSTIM4_WAIT4_Pos)                              /*!< 0x00008000 */

#define SMC_AMSTIM4_HLD4_Pos                                        (16U)
#define SMC_AMSTIM4_HLD4_Msk                                        (0xFFUL << SMC_AMSTIM4_HLD4_Pos)                               /*!< 0x00FF0000 */
#define SMC_AMSTIM4_HLD4                                            SMC_AMSTIM4_HLD4_Msk                                           /*!<ATTHOLD4[7:0] bits (Attribute memory 4 hold time) */
#define SMC_AMSTIM4_HLD4_0                                          (0x01UL << SMC_AMSTIM4_HLD4_Pos)                               /*!< 0x00010000 */
#define SMC_AMSTIM4_HLD4_1                                          (0x02UL << SMC_AMSTIM4_HLD4_Pos)                               /*!< 0x00020000 */
#define SMC_AMSTIM4_HLD4_2                                          (0x04UL << SMC_AMSTIM4_HLD4_Pos)                               /*!< 0x00040000 */
#define SMC_AMSTIM4_HLD4_3                                          (0x08UL << SMC_AMSTIM4_HLD4_Pos)                               /*!< 0x00080000 */
#define SMC_AMSTIM4_HLD4_4                                          (0x10UL << SMC_AMSTIM4_HLD4_Pos)                               /*!< 0x00100000 */
#define SMC_AMSTIM4_HLD4_5                                          (0x20UL << SMC_AMSTIM4_HLD4_Pos)                               /*!< 0x00200000 */
#define SMC_AMSTIM4_HLD4_6                                          (0x40UL << SMC_AMSTIM4_HLD4_Pos)                               /*!< 0x00400000 */
#define SMC_AMSTIM4_HLD4_7                                          (0x80UL << SMC_AMSTIM4_HLD4_Pos)                               /*!< 0x00800000 */

#define SMC_AMSTIM4_HIZ4_Pos                                        (24U)
#define SMC_AMSTIM4_HIZ4_Msk                                        (0xFFUL << SMC_AMSTIM4_HIZ4_Pos)                               /*!< 0xFF000000 */
#define SMC_AMSTIM4_HIZ4                                            SMC_AMSTIM4_HIZ4_Msk                                           /*!<ATTHIZ4[7:0] bits (Attribute memory 4 databus HiZ time) */
#define SMC_AMSTIM4_HIZ4_0                                          (0x01UL << SMC_AMSTIM4_HIZ4_Pos)                               /*!< 0x01000000 */
#define SMC_AMSTIM4_HIZ4_1                                          (0x02UL << SMC_AMSTIM4_HIZ4_Pos)                               /*!< 0x02000000 */
#define SMC_AMSTIM4_HIZ4_2                                          (0x04UL << SMC_AMSTIM4_HIZ4_Pos)                               /*!< 0x04000000 */
#define SMC_AMSTIM4_HIZ4_3                                          (0x08UL << SMC_AMSTIM4_HIZ4_Pos)                               /*!< 0x08000000 */
#define SMC_AMSTIM4_HIZ4_4                                          (0x10UL << SMC_AMSTIM4_HIZ4_Pos)                               /*!< 0x10000000 */
#define SMC_AMSTIM4_HIZ4_5                                          (0x20UL << SMC_AMSTIM4_HIZ4_Pos)                               /*!< 0x20000000 */
#define SMC_AMSTIM4_HIZ4_6                                          (0x40UL << SMC_AMSTIM4_HIZ4_Pos)                               /*!< 0x40000000 */
#define SMC_AMSTIM4_HIZ4_7                                          (0x80UL << SMC_AMSTIM4_HIZ4_Pos)                               /*!< 0x80000000 */

/******************  Bit definition for SMC_IOSTIM4 register  *******************/
#define SMC_IOSTIM4_SET4_Pos                                        (0U)
#define SMC_IOSTIM4_SET4_Msk                                        (0xFFUL << SMC_IOSTIM4_SET4_Pos)                               /*!< 0x000000FF */
#define SMC_IOSTIM4_SET4                                            SMC_IOSTIM4_SET4_Msk                                           /*!<IOSET4[7:0] bits (I/O 4 setup time) */
#define SMC_IOSTIM4_SET4_0                                          (0x01UL << SMC_IOSTIM4_SET4_Pos)                               /*!< 0x00000001 */
#define SMC_IOSTIM4_SET4_1                                          (0x02UL << SMC_IOSTIM4_SET4_Pos)                               /*!< 0x00000002 */
#define SMC_IOSTIM4_SET4_2                                          (0x04UL << SMC_IOSTIM4_SET4_Pos)                               /*!< 0x00000004 */
#define SMC_IOSTIM4_SET4_3                                          (0x08UL << SMC_IOSTIM4_SET4_Pos)                               /*!< 0x00000008 */
#define SMC_IOSTIM4_SET4_4                                          (0x10UL << SMC_IOSTIM4_SET4_Pos)                               /*!< 0x00000010 */
#define SMC_IOSTIM4_SET4_5                                          (0x20UL << SMC_IOSTIM4_SET4_Pos)                               /*!< 0x00000020 */
#define SMC_IOSTIM4_SET4_6                                          (0x40UL << SMC_IOSTIM4_SET4_Pos)                               /*!< 0x00000040 */
#define SMC_IOSTIM4_SET4_7                                          (0x80UL << SMC_IOSTIM4_SET4_Pos)                               /*!< 0x00000080 */

