betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
/* Legacy defines */
#define GPIO_BSC_BS_0                                               GPIO_BSC_BS0
#define GPIO_BSC_BS_1                                               GPIO_BSC_BS1
#define GPIO_BSC_BS_2                                               GPIO_BSC_BS2
#define GPIO_BSC_BS_3                                               GPIO_BSC_BS3
#define GPIO_BSC_BS_4                                               GPIO_BSC_BS4
#define GPIO_BSC_BS_5                                               GPIO_BSC_BS5
#define GPIO_BSC_BS_6                                               GPIO_BSC_BS6
#define GPIO_BSC_BS_7                                               GPIO_BSC_BS7
#define GPIO_BSC_BS_8                                               GPIO_BSC_BS8
#define GPIO_BSC_BS_9                                               GPIO_BSC_BS9
#define GPIO_BSC_BS_10                                              GPIO_BSC_BS10
#define GPIO_BSC_BS_11                                              GPIO_BSC_BS11
#define GPIO_BSC_BS_12                                              GPIO_BSC_BS12
#define GPIO_BSC_BS_13                                              GPIO_BSC_BS13
#define GPIO_BSC_BS_14                                              GPIO_BSC_BS14
#define GPIO_BSC_BS_15                                              GPIO_BSC_BS15
#define GPIO_BSC_BR_0                                               GPIO_BSC_BC0
#define GPIO_BSC_BR_1                                               GPIO_BSC_BC1
#define GPIO_BSC_BR_2                                               GPIO_BSC_BC2
#define GPIO_BSC_BR_3                                               GPIO_BSC_BC3
#define GPIO_BSC_BR_4                                               GPIO_BSC_BC4
#define GPIO_BSC_BR_5                                               GPIO_BSC_BC5
#define GPIO_BSC_BR_6                                               GPIO_BSC_BC6
#define GPIO_BSC_BR_7                                               GPIO_BSC_BC7
#define GPIO_BSC_BR_8                                               GPIO_BSC_BC8
#define GPIO_BSC_BR_9                                               GPIO_BSC_BC9
#define GPIO_BSC_BR_10                                              GPIO_BSC_BC10
#define GPIO_BSC_BR_11                                              GPIO_BSC_BC11
#define GPIO_BSC_BR_12                                              GPIO_BSC_BC12
#define GPIO_BSC_BR_13                                              GPIO_BSC_BC13
#define GPIO_BSC_BR_14                                              GPIO_BSC_BC14
#define GPIO_BSC_BR_15                                              GPIO_BSC_BC15
#define GPIO_BRR_BR0                                                GPIO_BSC_BC0
#define GPIO_BRR_BR0_Pos                                            GPIO_BSC_BC0_Pos
#define GPIO_BRR_BR0_Msk                                            GPIO_BSC_BC0_Msk
#define GPIO_BRR_BR1                                                GPIO_BSC_BC1
#define GPIO_BRR_BR1_Pos                                            GPIO_BSC_BC1_Pos
#define GPIO_BRR_BR1_Msk                                            GPIO_BSC_BC1_Msk
#define GPIO_BRR_BR2                                                GPIO_BSC_BC2
#define GPIO_BRR_BR2_Pos                                            GPIO_BSC_BC2_Pos
#define GPIO_BRR_BR2_Msk                                            GPIO_BSC_BC2_Msk
#define GPIO_BRR_BR3                                                GPIO_BSC_BC3
#define GPIO_BRR_BR3_Pos                                            GPIO_BSC_BC3_Pos
#define GPIO_BRR_BR3_Msk                                            GPIO_BSC_BC3_Msk
#define GPIO_BRR_BR4                                                GPIO_BSC_BC4
#define GPIO_BRR_BR4_Pos                                            GPIO_BSC_BC4_Pos
#define GPIO_BRR_BR4_Msk                                            GPIO_BSC_BC4_Msk
#define GPIO_BRR_BR5                                                GPIO_BSC_BC5
#define GPIO_BRR_BR5_Pos                                            GPIO_BSC_BC5_Pos
#define GPIO_BRR_BR5_Msk                                            GPIO_BSC_BC5_Msk
#define GPIO_BRR_BR6                                                GPIO_BSC_BC6
#define GPIO_BRR_BR6_Pos                                            GPIO_BSC_BC6_Pos
#define GPIO_BRR_BR6_Msk                                            GPIO_BSC_BC6_Msk
#define GPIO_BRR_BR7                                                GPIO_BSC_BC7
#define GPIO_BRR_BR7_Pos                                            GPIO_BSC_BC7_Pos
#define GPIO_BRR_BR7_Msk                                            GPIO_BSC_BC7_Msk
#define GPIO_BRR_BR8                                                GPIO_BSC_BC8
#define GPIO_BRR_BR8_Pos                                            GPIO_BSC_BC8_Pos
#define GPIO_BRR_BR8_Msk                                            GPIO_BSC_BC8_Msk
#define GPIO_BRR_BR9                                                GPIO_BSC_BC9
#define GPIO_BRR_BR9_Pos                                            GPIO_BSC_BC9_Pos
#define GPIO_BRR_BR9_Msk                                            GPIO_BSC_BC9_Msk
#define GPIO_BRR_BR10                                               GPIO_BSC_BC10
#define GPIO_BRR_BR10_Pos                                           GPIO_BSC_BC10_Pos
#define GPIO_BRR_BR10_Msk                                           GPIO_BSC_BC10_Msk
#define GPIO_BRR_BR11                                               GPIO_BSC_BC11
#define GPIO_BRR_BR11_Pos                                           GPIO_BSC_BC11_Pos
#define GPIO_BRR_BR11_Msk                                           GPIO_BSC_BC11_Msk
#define GPIO_BRR_BR12                                               GPIO_BSC_BC12
#define GPIO_BRR_BR12_Pos                                           GPIO_BSC_BC12_Pos
#define GPIO_BRR_BR12_Msk                                           GPIO_BSC_BC12_Msk
#define GPIO_BRR_BR13                                               GPIO_BSC_BC13
#define GPIO_BRR_BR13_Pos                                           GPIO_BSC_BC13_Pos
#define GPIO_BRR_BR13_Msk                                           GPIO_BSC_BC13_Msk
#define GPIO_BRR_BR14                                               GPIO_BSC_BC14
#define GPIO_BRR_BR14_Pos                                           GPIO_BSC_BC14_Pos
#define GPIO_BRR_BR14_Msk                                           GPIO_BSC_BC14_Msk
#define GPIO_BRR_BR15                                               GPIO_BSC_BC15
#define GPIO_BRR_BR15_Pos                                           GPIO_BSC_BC15_Pos
#define GPIO_BRR_BR15_Msk                                           GPIO_BSC_BC15_Msk
/****************** Bit definition for GPIO_LOCK register *********************/
#define GPIO_LOCK_LOCK0_Pos                                         (0U)
#define GPIO_LOCK_LOCK0_Msk                                         (0x1UL << GPIO_LOCK_LOCK0_Pos)                                 /*!< 0x00000001 */
#define GPIO_LOCK_LOCK0                                             GPIO_LOCK_LOCK0_Msk
#define GPIO_LOCK_LOCK1_Pos                                         (1U)
#define GPIO_LOCK_LOCK1_Msk                                         (0x1UL << GPIO_LOCK_LOCK1_Pos)                                 /*!< 0x00000002 */
#define GPIO_LOCK_LOCK1                                             GPIO_LOCK_LOCK1_Msk
#define GPIO_LOCK_LOCK2_Pos                                         (2U)
#define GPIO_LOCK_LOCK2_Msk                                         (0x1UL << GPIO_LOCK_LOCK2_Pos)                                 /*!< 0x00000004 */
#define GPIO_LOCK_LOCK2                                             GPIO_LOCK_LOCK2_Msk
#define GPIO_LOCK_LOCK3_Pos                                         (3U)
#define GPIO_LOCK_LOCK3_Msk                                         (0x1UL << GPIO_LOCK_LOCK3_Pos)                                 /*!< 0x00000008 */
#define GPIO_LOCK_LOCK3                                             GPIO_LOCK_LOCK3_Msk
#define GPIO_LOCK_LOCK4_Pos                                         (4U)
#define GPIO_LOCK_LOCK4_Msk                                         (0x1UL << GPIO_LOCK_LOCK4_Pos)                                 /*!< 0x00000010 */
#define GPIO_LOCK_LOCK4                                             GPIO_LOCK_LOCK4_Msk
#define GPIO_LOCK_LOCK5_Pos                                         (5U)
#define GPIO_LOCK_LOCK5_Msk                                         (0x1UL << GPIO_LOCK_LOCK5_Pos)                                 /*!< 0x00000020 */
#define GPIO_LOCK_LOCK5                                             GPIO_LOCK_LOCK5_Msk
#define GPIO_LOCK_LOCK6_Pos                                         (6U)
#define GPIO_LOCK_LOCK6_Msk                                         (0x1UL << GPIO_LOCK_LOCK6_Pos)                                 /*!< 0x00000040 */
#define GPIO_LOCK_LOCK6                                             GPIO_LOCK_LOCK6_Msk
#define GPIO_LOCK_LOCK7_Pos                                         (7U)
#define GPIO_LOCK_LOCK7_Msk                                         (0x1UL << GPIO_LOCK_LOCK7_Pos)                                 /*!< 0x00000080 */
#define GPIO_LOCK_LOCK7                                             GPIO_LOCK_LOCK7_Msk
#define GPIO_LOCK_LOCK8_Pos                                         (8U)
#define GPIO_LOCK_LOCK8_Msk                                         (0x1UL << GPIO_LOCK_LOCK8_Pos)                                 /*!< 0x00000100 */
#define GPIO_LOCK_LOCK8                                             GPIO_LOCK_LOCK8_Msk
#define GPIO_LOCK_LOCK9_Pos                                         (9U)
#define GPIO_LOCK_LOCK9_Msk                                         (0x1UL << GPIO_LOCK_LOCK9_Pos)                                 /*!< 0x00000200 */
#define GPIO_LOCK_LOCK9                                             GPIO_LOCK_LOCK9_Msk
#define GPIO_LOCK_LOCK10_Pos                                        (10U)
#define GPIO_LOCK_LOCK10_Msk                                        (0x1UL << GPIO_LOCK_LOCK10_Pos)                                /*!< 0x00000400 */
#define GPIO_LOCK_LOCK10                                            GPIO_LOCK_LOCK10_Msk
#define GPIO_LOCK_LOCK11_Pos                                        (11U)
#define GPIO_LOCK_LOCK11_Msk                                        (0x1UL << GPIO_LOCK_LOCK11_Pos)                                /*!< 0x00000800 */
#define GPIO_LOCK_LOCK11                                            GPIO_LOCK_LOCK11_Msk
#define GPIO_LOCK_LOCK12_Pos                                        (12U)
#define GPIO_LOCK_LOCK12_Msk                                        (0x1UL << GPIO_LOCK_LOCK12_Pos)                                /*!< 0x00001000 */
#define GPIO_LOCK_LOCK12                                            GPIO_LOCK_LOCK12_Msk
#define GPIO_LOCK_LOCK13_Pos                                        (13U)
#define GPIO_LOCK_LOCK13_Msk                                        (0x1UL << GPIO_LOCK_LOCK13_Pos)                                /*!< 0x00002000 */
#define GPIO_LOCK_LOCK13                                            GPIO_LOCK_LOCK13_Msk
#define GPIO_LOCK_LOCK14_Pos                                        (14U)
#define GPIO_LOCK_LOCK14_Msk                                        (0x1UL << GPIO_LOCK_LOCK14_Pos)                                /*!< 0x00004000 */
#define GPIO_LOCK_LOCK14                                            GPIO_LOCK_LOCK14_Msk
#define GPIO_LOCK_LOCK15_Pos                                        (15U)
#define GPIO_LOCK_LOCK15_Msk                                        (0x1UL << GPIO_LOCK_LOCK15_Pos)                                /*!< 0x00008000 */
#define GPIO_LOCK_LOCK15                                            GPIO_LOCK_LOCK15_Msk
#define GPIO_LOCK_LOCKKEY_Pos                                       (16U)
#define GPIO_LOCK_LOCKKEY_Msk                                       (0x1UL << GPIO_LOCK_LOCKKEY_Pos)                               /*!< 0x00010000 */
#define GPIO_LOCK_LOCKKEY                                           GPIO_LOCK_LOCKKEY_Msk
/****************** Bit definition for GPIO_ALFL register *********************/
#define GPIO_ALFL_ALFSEL0_Pos                                       (0U)
#define GPIO_ALFL_ALFSEL0_Msk                                       (0xFUL << GPIO_ALFL_ALFSEL0_Pos)                               /*!< 0x0000000F */
#define GPIO_ALFL_ALFSEL0                                           GPIO_ALFL_ALFSEL0_Msk
#define GPIO_ALFL_ALFSEL0_0                                         (0x1UL << GPIO_ALFL_ALFSEL0_Pos)                               /*!< 0x00000001 */
#define GPIO_ALFL_ALFSEL0_1                                         (0x2UL << GPIO_ALFL_ALFSEL0_Pos)                               /*!< 0x00000002 */
#define GPIO_ALFL_ALFSEL0_2                                         (0x4UL << GPIO_ALFL_ALFSEL0_Pos)                               /*!< 0x00000004 */
#define GPIO_ALFL_ALFSEL0_3                                         (0x8UL << GPIO_ALFL_ALFSEL0_Pos)                               /*!< 0x00000008 */
#define GPIO_ALFL_ALFSEL1_Pos                                       (4U)
#define GPIO_ALFL_ALFSEL1_Msk                                       (0xFUL << GPIO_ALFL_ALFSEL1_Pos)                               /*!< 0x000000F0 */
#define GPIO_ALFL_ALFSEL1                                           GPIO_ALFL_ALFSEL1_Msk
#define GPIO_ALFL_ALFSEL1_0                                         (0x1UL << GPIO_ALFL_ALFSEL1_Pos)                               /*!< 0x00000010 */
#define GPIO_ALFL_ALFSEL1_1                                         (0x2UL << GPIO_ALFL_ALFSEL1_Pos)                               /*!< 0x00000020 */
#define GPIO_ALFL_ALFSEL1_2                                         (0x4UL << GPIO_ALFL_ALFSEL1_Pos)                               /*!< 0x00000040 */
#define GPIO_ALFL_ALFSEL1_3                                         (0x8UL << GPIO_ALFL_ALFSEL1_Pos)                               /*!< 0x00000080 */
#define GPIO_ALFL_ALFSEL2_Pos                                       (8U)
#define GPIO_ALFL_ALFSEL2_Msk                                       (0xFUL << GPIO_ALFL_ALFSEL2_Pos)                               /*!< 0x00000F00 */
#define GPIO_ALFL_ALFSEL2                                           GPIO_ALFL_ALFSEL2_Msk
#define GPIO_ALFL_ALFSEL2_0                                         (0x1UL << GPIO_ALFL_ALFSEL2_Pos)                               /*!< 0x00000100 */
#define GPIO_ALFL_ALFSEL2_1                                         (0x2UL << GPIO_ALFL_ALFSEL2_Pos)                               /*!< 0x00000200 */
#define GPIO_ALFL_ALFSEL2_2                                         (0x4UL << GPIO_ALFL_ALFSEL2_Pos)                               /*!< 0x00000400 */
#define GPIO_ALFL_ALFSEL2_3                                         (0x8UL << GPIO_ALFL_ALFSEL2_Pos)                               /*!< 0x00000800 */
#define GPIO_ALFL_ALFSEL3_Pos                                       (12U)
#define GPIO_ALFL_ALFSEL3_Msk                                       (0xFUL << GPIO_ALFL_ALFSEL3_Pos)                               /*!< 0x0000F000 */
#define GPIO_ALFL_ALFSEL3                                           GPIO_ALFL_ALFSEL3_Msk
#define GPIO_ALFL_ALFSEL3_0                                         (0x1UL << GPIO_ALFL_ALFSEL3_Pos)                               /*!< 0x00001000 */
#define GPIO_ALFL_ALFSEL3_1                                         (0x2UL << GPIO_ALFL_ALFSEL3_Pos)                               /*!< 0x00002000 */
#define GPIO_ALFL_ALFSEL3_2                                         (0x4UL << GPIO_ALFL_ALFSEL3_Pos)                               /*!< 0x00004000 */
#define GPIO_ALFL_ALFSEL3_3                                         (0x8UL << GPIO_ALFL_ALFSEL3_Pos)                               /*!< 0x00008000 */
#define GPIO_ALFL_ALFSEL4_Pos                                       (16U)
#define GPIO_ALFL_ALFSEL4_Msk                                       (0xFUL << GPIO_ALFL_ALFSEL4_Pos)                               /*!< 0x000F0000 */
#define GPIO_ALFL_ALFSEL4                                           GPIO_ALFL_ALFSEL4_Msk
#define GPIO_ALFL_ALFSEL4_0                                         (0x1UL << GPIO_ALFL_ALFSEL4_Pos)                               /*!< 0x00010000 */
#define GPIO_ALFL_ALFSEL4_1                                         (0x2UL << GPIO_ALFL_ALFSEL4_Pos)                               /*!< 0x00020000 */
#define GPIO_ALFL_ALFSEL4_2                                         (0x4UL << GPIO_ALFL_ALFSEL4_Pos)                               /*!< 0x00040000 */
#define GPIO_ALFL_ALFSEL4_3                                         (0x8UL << GPIO_ALFL_ALFSEL4_Pos)                               /*!< 0x00080000 */
#define GPIO_ALFL_ALFSEL5_Pos                                       (20U)
#define GPIO_ALFL_ALFSEL5_Msk                                       (0xFUL << GPIO_ALFL_ALFSEL5_Pos)                               /*!< 0x00F00000 */
#define GPIO_ALFL_ALFSEL5                                           GPIO_ALFL_ALFSEL5_Msk
#define GPIO_ALFL_ALFSEL5_0                                         (0x1UL << GPIO_ALFL_ALFSEL5_Pos)                               /*!< 0x00100000 */
#define GPIO_ALFL_ALFSEL5_1                                         (0x2UL << GPIO_ALFL_ALFSEL5_Pos)                               /*!< 0x00200000 */
#define GPIO_ALFL_ALFSEL5_2                                         (0x4UL << GPIO_ALFL_ALFSEL5_Pos)                               /*!< 0x00400000 */
#define GPIO_ALFL_ALFSEL5_3                                         (0x8UL << GPIO_ALFL_ALFSEL5_Pos)                               /*!< 0x00800000 */
#define GPIO_ALFL_ALFSEL6_Pos                                       (24U)
#define GPIO_ALFL_ALFSEL6_Msk                                       (0xFUL << GPIO_ALFL_ALFSEL6_Pos)                               /*!< 0x0F000000 */
#define GPIO_ALFL_ALFSEL6                                           GPIO_ALFL_ALFSEL6_Msk
#define GPIO_ALFL_ALFSEL6_0                                         (0x1UL << GPIO_ALFL_ALFSEL6_Pos)                               /*!< 0x01000000 */
#define GPIO_ALFL_ALFSEL6_1                                         (0x2UL << GPIO_ALFL_ALFSEL6_Pos)                               /*!< 0x02000000 */
#define GPIO_ALFL_ALFSEL6_2                                         (0x4UL << GPIO_ALFL_ALFSEL6_Pos)                               /*!< 0x04000000 */
#define GPIO_ALFL_ALFSEL6_3                                         (0x8UL << GPIO_ALFL_ALFSEL6_Pos)                               /*!< 0x08000000 */
#define GPIO_ALFL_ALFSEL7_Pos                                       (28U)
#define GPIO_ALFL_ALFSEL7_Msk                                       (0xFUL << GPIO_ALFL_ALFSEL7_Pos)                               /*!< 0xF0000000 */
#define GPIO_ALFL_ALFSEL7                                           GPIO_ALFL_ALFSEL7_Msk
#define GPIO_ALFL_ALFSEL7_0                                         (0x1UL << GPIO_ALFL_ALFSEL7_Pos)                               /*!< 0x10000000 */
#define GPIO_ALFL_ALFSEL7_1                                         (0x2UL << GPIO_ALFL_ALFSEL7_Pos)                               /*!< 0x20000000 */
#define GPIO_ALFL_ALFSEL7_2                                         (0x4UL << GPIO_ALFL_ALFSEL7_Pos)                               /*!< 0x40000000 */
#define GPIO_ALFL_ALFSEL7_3                                         (0x8UL << GPIO_ALFL_ALFSEL7_Pos)                               /*!< 0x80000000 */

