betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
/*******************  Bit definition for I2C_SADDR2 register  *******************/
#define I2C_SADDR2_ADDRNUM_Pos                                      (0U)
#define I2C_SADDR2_ADDRNUM_Msk                                      (0x1UL << I2C_SADDR2_ADDRNUM_Pos)                              /*!< 0x00000001 */
#define I2C_SADDR2_ADDRNUM                                          I2C_SADDR2_ADDRNUM_Msk                                         /*!<Dual addressing mode enable */
#define I2C_SADDR2_ADDR2_Pos                                        (1U)
#define I2C_SADDR2_ADDR2_Msk                                        (0x7FUL << I2C_SADDR2_ADDR2_Pos)                               /*!< 0x000000FE */
#define I2C_SADDR2_ADDR2                                            I2C_SADDR2_ADDR2_Msk                                           /*!<Interface address           */

/********************  Bit definition for I2C_DATA register  ********************/
#define I2C_DATA_DATA_Pos                                           (0U)
#define I2C_DATA_DATA_Msk                                           (0xFFUL << I2C_DATA_DATA_Pos)                                  /*!< 0x000000FF */
#define I2C_DATA_DATA                                               I2C_DATA_DATA_Msk                                              /*!<8-bit Data Register         */

/*******************  Bit definition for I2C_STS1 register  ********************/
#define I2C_STS1_STARTFLG_Pos                                       (0U)
#define I2C_STS1_STARTFLG_Msk                                       (0x1UL << I2C_STS1_STARTFLG_Pos)                               /*!< 0x00000001 */
#define I2C_STS1_STARTFLG                                           I2C_STS1_STARTFLG_Msk                                          /*!<Start Bit (Master mode)                         */
#define I2C_STS1_ADDRFLG_Pos                                        (1U)
#define I2C_STS1_ADDRFLG_Msk                                        (0x1UL << I2C_STS1_ADDRFLG_Pos)                                /*!< 0x00000002 */
#define I2C_STS1_ADDRFLG                                            I2C_STS1_ADDRFLG_Msk                                           /*!<Address sent (master mode)/matched (slave mode) */
#define I2C_STS1_BTCFLG_Pos                                         (2U)
#define I2C_STS1_BTCFLG_Msk                                         (0x1UL << I2C_STS1_BTCFLG_Pos)                                 /*!< 0x00000004 */
#define I2C_STS1_BTCFLG                                             I2C_STS1_BTCFLG_Msk                                            /*!<Byte Transfer Finished                          */
#define I2C_STS1_ADDR10FLG_Pos                                      (3U)
#define I2C_STS1_ADDR10FLG_Msk                                      (0x1UL << I2C_STS1_ADDR10FLG_Pos)                              /*!< 0x00000008 */
#define I2C_STS1_ADDR10FLG                                          I2C_STS1_ADDR10FLG_Msk                                         /*!<10-bit header sent (Master mode)                */
#define I2C_STS1_STOPFLG_Pos                                        (4U)
#define I2C_STS1_STOPFLG_Msk                                        (0x1UL << I2C_STS1_STOPFLG_Pos)                                /*!< 0x00000010 */
#define I2C_STS1_STOPFLG                                            I2C_STS1_STOPFLG_Msk                                           /*!<Stop detection (Slave mode)                     */
#define I2C_STS1_RXBNEFLG_Pos                                       (6U)
#define I2C_STS1_RXBNEFLG_Msk                                       (0x1UL << I2C_STS1_RXBNEFLG_Pos)                               /*!< 0x00000040 */
#define I2C_STS1_RXBNEFLG                                           I2C_STS1_RXBNEFLG_Msk                                          /*!<Data Register not Empty (receivers)             */
#define I2C_STS1_TXBEFLG_Pos                                        (7U)
#define I2C_STS1_TXBEFLG_Msk                                        (0x1UL << I2C_STS1_TXBEFLG_Pos)                                /*!< 0x00000080 */
#define I2C_STS1_TXBEFLG                                            I2C_STS1_TXBEFLG_Msk                                           /*!<Data Register Empty (transmitters)              */
#define I2C_STS1_BERRFLG_Pos                                        (8U)
#define I2C_STS1_BERRFLG_Msk                                        (0x1UL << I2C_STS1_BERRFLG_Pos)                                /*!< 0x00000100 */
#define I2C_STS1_BERRFLG                                            I2C_STS1_BERRFLG_Msk                                           /*!<Bus Error                                       */
#define I2C_STS1_ALFLG_Pos                                          (9U)
#define I2C_STS1_ALFLG_Msk                                          (0x1UL << I2C_STS1_ALFLG_Pos)                                  /*!< 0x00000200 */
#define I2C_STS1_ALFLG                                              I2C_STS1_ALFLG_Msk                                             /*!<Arbitration Lost (master mode)                  */
#define I2C_STS1_AEFLG_Pos                                          (10U)
#define I2C_STS1_AEFLG_Msk                                          (0x1UL << I2C_STS1_AEFLG_Pos)                                  /*!< 0x00000400 */
#define I2C_STS1_AEFLG                                              I2C_STS1_AEFLG_Msk                                             /*!<Acknowledge Failure                             */
#define I2C_STS1_OVRURFLG_Pos                                       (11U)
#define I2C_STS1_OVRURFLG_Msk                                       (0x1UL << I2C_STS1_OVRURFLG_Pos)                               /*!< 0x00000800 */
#define I2C_STS1_OVRURFLG                                           I2C_STS1_OVRURFLG_Msk                                          /*!<Overrun/Underrun                                */
#define I2C_STS1_PECEFLG_Pos                                        (12U)
#define I2C_STS1_PECEFLG_Msk                                        (0x1UL << I2C_STS1_PECEFLG_Pos)                                /*!< 0x00001000 */
#define I2C_STS1_PECEFLG                                            I2C_STS1_PECEFLG_Msk                                           /*!<PEC Error in reception                          */
#define I2C_STS1_TTEFLG_Pos                                         (14U)
#define I2C_STS1_TTEFLG_Msk                                         (0x1UL << I2C_STS1_TTEFLG_Pos)                                 /*!< 0x00004000 */
#define I2C_STS1_TTEFLG                                             I2C_STS1_TTEFLG_Msk                                            /*!<Timeout or Tlow Error                           */
#define I2C_STS1_SMBALTFLG_Pos                                      (15U)
#define I2C_STS1_SMBALTFLG_Msk                                      (0x1UL << I2C_STS1_SMBALTFLG_Pos)                              /*!< 0x00008000 */
#define I2C_STS1_SMBALTFLG                                          I2C_STS1_SMBALTFLG_Msk                                         /*!<SMBus Alert                                     */

/*******************  Bit definition for I2C_STS2 register  ********************/
#define I2C_STS2_MSFLG_Pos                                          (0U)
#define I2C_STS2_MSFLG_Msk                                          (0x1UL << I2C_STS2_MSFLG_Pos)                                  /*!< 0x00000001 */
#define I2C_STS2_MSFLG                                              I2C_STS2_MSFLG_Msk                                             /*!<Master/Slave                                    */
#define I2C_STS2_BUSBSYFLG_Pos                                      (1U)
#define I2C_STS2_BUSBSYFLG_Msk                                      (0x1UL << I2C_STS2_BUSBSYFLG_Pos)                              /*!< 0x00000002 */
#define I2C_STS2_BUSBSYFLG                                          I2C_STS2_BUSBSYFLG_Msk                                         /*!<Bus Busy                                        */
#define I2C_STS2_TRFLG_Pos                                          (2U)
#define I2C_STS2_TRFLG_Msk                                          (0x1UL << I2C_STS2_TRFLG_Pos)                                  /*!< 0x00000004 */
#define I2C_STS2_TRFLG                                              I2C_STS2_TRFLG_Msk                                             /*!<Transmitter/Receiver                            */
#define I2C_STS2_GENCALLFLG_Pos                                     (4U)
#define I2C_STS2_GENCALLFLG_Msk                                     (0x1UL << I2C_STS2_GENCALLFLG_Pos)                             /*!< 0x00000010 */
#define I2C_STS2_GENCALLFLG                                         I2C_STS2_GENCALLFLG_Msk                                        /*!<General Call Address (Slave mode)               */
#define I2C_STS2_SMBDADDRFLG_Pos                                    (5U)
#define I2C_STS2_SMBDADDRFLG_Msk                                    (0x1UL << I2C_STS2_SMBDADDRFLG_Pos)                            /*!< 0x00000020 */
#define I2C_STS2_SMBDADDRFLG                                        I2C_STS2_SMBDADDRFLG_Msk                                       /*!<SMBus Device Default Address (Slave mode)       */
#define I2C_STS2_SMMHADDR_Pos                                       (6U)
#define I2C_STS2_SMMHADDR_Msk                                       (0x1UL << I2C_STS2_SMMHADDR_Pos)                               /*!< 0x00000040 */
#define I2C_STS2_SMMHADDR                                           I2C_STS2_SMMHADDR_Msk                                          /*!<SMBus Host Header (Slave mode)                  */
#define I2C_STS2_DUALADDRFLG_Pos                                    (7U)
#define I2C_STS2_DUALADDRFLG_Msk                                    (0x1UL << I2C_STS2_DUALADDRFLG_Pos)                            /*!< 0x00000080 */
#define I2C_STS2_DUALADDRFLG                                        I2C_STS2_DUALADDRFLG_Msk                                       /*!<Dual Flag (Slave mode)                          */
#define I2C_STS2_PECVALUE_Pos                                       (8U)
#define I2C_STS2_PECVALUE_Msk                                       (0xFFUL << I2C_STS2_PECVALUE_Pos)                              /*!< 0x0000FF00 */
#define I2C_STS2_PECVALUE                                           I2C_STS2_PECVALUE_Msk                                          /*!<Packet Error Checking Register                  */

/*******************  Bit definition for I2C_CLKCTRL register  ********************/
#define I2C_CLKCTRL_CLKS_Pos                                        (0U)
#define I2C_CLKCTRL_CLKS_Msk                                        (0xFFFUL << I2C_CLKCTRL_CLKS_Pos)                              /*!< 0x00000FFF */
#define I2C_CLKCTRL_CLKS                                            I2C_CLKCTRL_CLKS_Msk                                           /*!<Clock Control Register in Fast/Standard mode (Master mode) */
#define I2C_CLKCTRL_FDUTYCFG_Pos                                    (14U)
#define I2C_CLKCTRL_FDUTYCFG_Msk                                    (0x1UL << I2C_CLKCTRL_FDUTYCFG_Pos)                            /*!< 0x00004000 */
#define I2C_CLKCTRL_FDUTYCFG                                        I2C_CLKCTRL_FDUTYCFG_Msk                                       /*!<Fast Mode Duty Cycle                                       */
#define I2C_CLKCTRL_SPEEDCFG_Pos                                    (15U)
#define I2C_CLKCTRL_SPEEDCFG_Msk                                    (0x1UL << I2C_CLKCTRL_SPEEDCFG_Pos)                            /*!< 0x00008000 */
#define I2C_CLKCTRL_SPEEDCFG                                        I2C_CLKCTRL_SPEEDCFG_Msk                                       /*!<I2C Master Mode Selection                                  */

