betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
#define RCM_CFG_MCO1PSC_Pos                                         (24U)
#define RCM_CFG_MCO1PSC_Msk                                         (0x7UL << RCM_CFG_MCO1PSC_Pos)                                 /*!< 0x07000000 */
#define RCM_CFG_MCO1PSC                                             RCM_CFG_MCO1PSC_Msk
#define RCM_CFG_MCO1PSC_0                                           (0x1UL << RCM_CFG_MCO1PSC_Pos)                                 /*!< 0x01000000 */
#define RCM_CFG_MCO1PSC_1                                           (0x2UL << RCM_CFG_MCO1PSC_Pos)                                 /*!< 0x02000000 */
#define RCM_CFG_MCO1PSC_2                                           (0x4UL << RCM_CFG_MCO1PSC_Pos)                                 /*!< 0x04000000 */

#define RCM_CFG_MCO2PSC_Pos                                         (27U)
#define RCM_CFG_MCO2PSC_Msk                                         (0x7UL << RCM_CFG_MCO2PSC_Pos)                                 /*!< 0x38000000 */
#define RCM_CFG_MCO2PSC                                             RCM_CFG_MCO2PSC_Msk
#define RCM_CFG_MCO2PSC_0                                           (0x1UL << RCM_CFG_MCO2PSC_Pos)                                 /*!< 0x08000000 */
#define RCM_CFG_MCO2PSC_1                                           (0x2UL << RCM_CFG_MCO2PSC_Pos)                                 /*!< 0x10000000 */
#define RCM_CFG_MCO2PSC_2                                           (0x4UL << RCM_CFG_MCO2PSC_Pos)                                 /*!< 0x20000000 */

#define RCM_CFG_MCO2SEL_Pos                                         (30U)
#define RCM_CFG_MCO2SEL_Msk                                         (0x3UL << RCM_CFG_MCO2SEL_Pos)                                 /*!< 0xC0000000 */
#define RCM_CFG_MCO2SEL                                             RCM_CFG_MCO2SEL_Msk
#define RCM_CFG_MCO2SEL_0                                           (0x1UL << RCM_CFG_MCO2SEL_Pos)                                 /*!< 0x40000000 */
#define RCM_CFG_MCO2SEL_1                                           (0x2UL << RCM_CFG_MCO2SEL_Pos)                                 /*!< 0x80000000 */

/********************  Bit definition for RCM_INT register  *******************/
#define RCM_INT_LSIRDYFLG_Pos                                       (0U)
#define RCM_INT_LSIRDYFLG_Msk                                       (0x1UL << RCM_INT_LSIRDYFLG_Pos)                               /*!< 0x00000001 */
#define RCM_INT_LSIRDYFLG                                           RCM_INT_LSIRDYFLG_Msk
#define RCM_INT_LSERDYFLG_Pos                                       (1U)
#define RCM_INT_LSERDYFLG_Msk                                       (0x1UL << RCM_INT_LSERDYFLG_Pos)                               /*!< 0x00000002 */
#define RCM_INT_LSERDYFLG                                           RCM_INT_LSERDYFLG_Msk
#define RCM_INT_HSIRDYFLG_Pos                                       (2U)
#define RCM_INT_HSIRDYFLG_Msk                                       (0x1UL << RCM_INT_HSIRDYFLG_Pos)                               /*!< 0x00000004 */
#define RCM_INT_HSIRDYFLG                                           RCM_INT_HSIRDYFLG_Msk
#define RCM_INT_HSERDYFLG_Pos                                       (3U)
#define RCM_INT_HSERDYFLG_Msk                                       (0x1UL << RCM_INT_HSERDYFLG_Pos)                               /*!< 0x00000008 */
#define RCM_INT_HSERDYFLG                                           RCM_INT_HSERDYFLG_Msk
#define RCM_INT_PLL1RDYFLG_Pos                                      (4U)
#define RCM_INT_PLL1RDYFLG_Msk                                      (0x1UL << RCM_INT_PLL1RDYFLG_Pos)                              /*!< 0x00000010 */
#define RCM_INT_PLL1RDYFLG                                          RCM_INT_PLL1RDYFLG_Msk
#define RCM_INT_PLL2RDYFLG_Pos                                      (5U)
#define RCM_INT_PLL2RDYFLG_Msk                                      (0x1UL << RCM_INT_PLL2RDYFLG_Pos)                              /*!< 0x00000020 */
#define RCM_INT_PLL2RDYFLG                                          RCM_INT_PLL2RDYFLG_Msk

#define RCM_INT_CSSFLG_Pos                                          (7U)
#define RCM_INT_CSSFLG_Msk                                          (0x1UL << RCM_INT_CSSFLG_Pos)                                  /*!< 0x00000080 */
#define RCM_INT_CSSFLG                                              RCM_INT_CSSFLG_Msk
#define RCM_INT_LSIRDYEN_Pos                                        (8U)
#define RCM_INT_LSIRDYEN_Msk                                        (0x1UL << RCM_INT_LSIRDYEN_Pos)                                /*!< 0x00000100 */
#define RCM_INT_LSIRDYEN                                            RCM_INT_LSIRDYEN_Msk
#define RCM_INT_LSERDYEN_Pos                                        (9U)
#define RCM_INT_LSERDYEN_Msk                                        (0x1UL << RCM_INT_LSERDYEN_Pos)                                /*!< 0x00000200 */
#define RCM_INT_LSERDYEN                                            RCM_INT_LSERDYEN_Msk
#define RCM_INT_HSIRDYEN_Pos                                        (10U)
#define RCM_INT_HSIRDYEN_Msk                                        (0x1UL << RCM_INT_HSIRDYEN_Pos)                                /*!< 0x00000400 */
#define RCM_INT_HSIRDYEN                                            RCM_INT_HSIRDYEN_Msk
#define RCM_INT_HSERDYEN_Pos                                        (11U)
#define RCM_INT_HSERDYEN_Msk                                        (0x1UL << RCM_INT_HSERDYEN_Pos)                                /*!< 0x00000800 */
#define RCM_INT_HSERDYEN                                            RCM_INT_HSERDYEN_Msk
#define RCM_INT_PLL1RDYEN_Pos                                       (12U)
#define RCM_INT_PLL1RDYEN_Msk                                       (0x1UL << RCM_INT_PLL1RDYEN_Pos)                               /*!< 0x00001000 */
#define RCM_INT_PLL1RDYEN                                           RCM_INT_PLL1RDYEN_Msk
#define RCM_INT_PLL2RDYEN_Pos                                       (13U)
#define RCM_INT_PLL2RDYEN_Msk                                       (0x1UL << RCM_INT_PLL2RDYEN_Pos)                               /*!< 0x00002000 */
#define RCM_INT_PLL2RDYEN                                           RCM_INT_PLL2RDYEN_Msk

