betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define RCM_LPAHB1_SUPPORT

/********************  Bit definition for RCM_LPAHB1CLKEN register  *************/
#define RCM_LPAHB1CLKEN_PALPEN_Pos                                  (0U)
#define RCM_LPAHB1CLKEN_PALPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PALPEN_Pos)                          /*!< 0x00000001 */
#define RCM_LPAHB1CLKEN_PALPEN                                      RCM_LPAHB1CLKEN_PALPEN_Msk
#define RCM_LPAHB1CLKEN_PBLPEN_Pos                                  (1U)
#define RCM_LPAHB1CLKEN_PBLPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PBLPEN_Pos)                          /*!< 0x00000002 */
#define RCM_LPAHB1CLKEN_PBLPEN                                      RCM_LPAHB1CLKEN_PBLPEN_Msk
#define RCM_LPAHB1CLKEN_PCLPEN_Pos                                  (2U)
#define RCM_LPAHB1CLKEN_PCLPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PCLPEN_Pos)                          /*!< 0x00000004 */
#define RCM_LPAHB1CLKEN_PCLPEN                                      RCM_LPAHB1CLKEN_PCLPEN_Msk
#define RCM_LPAHB1CLKEN_PDLPEN_Pos                                  (3U)
#define RCM_LPAHB1CLKEN_PDLPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PDLPEN_Pos)                          /*!< 0x00000008 */
#define RCM_LPAHB1CLKEN_PDLPEN                                      RCM_LPAHB1CLKEN_PDLPEN_Msk
#define RCM_LPAHB1CLKEN_PELPEN_Pos                                  (4U)
#define RCM_LPAHB1CLKEN_PELPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PELPEN_Pos)                          /*!< 0x00000010 */
#define RCM_LPAHB1CLKEN_PELPEN                                      RCM_LPAHB1CLKEN_PELPEN_Msk
#define RCM_LPAHB1CLKEN_PHLPEN_Pos                                  (7U)
#define RCM_LPAHB1CLKEN_PHLPEN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_PHLPEN_Pos)                          /*!< 0x00000080 */
#define RCM_LPAHB1CLKEN_PHLPEN                                      RCM_LPAHB1CLKEN_PHLPEN_Msk
#define RCM_LPAHB1CLKEN_CRCLPEN_Pos                                 (12U)
#define RCM_LPAHB1CLKEN_CRCLPEN_Msk                                 (0x1UL << RCM_LPAHB1CLKEN_CRCLPEN_Pos)                         /*!< 0x00001000 */
#define RCM_LPAHB1CLKEN_CRCLPEN                                     RCM_LPAHB1CLKEN_CRCLPEN_Msk
#define RCM_LPAHB1CLKEN_FMCEN_Pos                                   (15U)
#define RCM_LPAHB1CLKEN_FMCEN_Msk                                   (0x1UL << RCM_LPAHB1CLKEN_FMCEN_Pos)                           /*!< 0x00008000 */
#define RCM_LPAHB1CLKEN_FMCEN                                       RCM_LPAHB1CLKEN_FMCEN_Msk
#define RCM_LPAHB1CLKEN_SRAM1EN_Pos                                 (16U)
#define RCM_LPAHB1CLKEN_SRAM1EN_Msk                                 (0x1UL << RCM_LPAHB1CLKEN_SRAM1EN_Pos)                         /*!< 0x00010000 */
#define RCM_LPAHB1CLKEN_SRAM1EN                                     RCM_LPAHB1CLKEN_SRAM1EN_Msk
#define RCM_LPAHB1CLKEN_DMA1EN_Pos                                  (21U)
#define RCM_LPAHB1CLKEN_DMA1EN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_DMA1EN_Pos)                          /*!< 0x00200000 */
#define RCM_LPAHB1CLKEN_DMA1EN                                      RCM_LPAHB1CLKEN_DMA1EN_Msk
#define RCM_LPAHB1CLKEN_DMA2EN_Pos                                  (22U)
#define RCM_LPAHB1CLKEN_DMA2EN_Msk                                  (0x1UL << RCM_LPAHB1CLKEN_DMA2EN_Pos)                          /*!< 0x00400000 */
#define RCM_LPAHB1CLKEN_DMA2EN                                      RCM_LPAHB1CLKEN_DMA2EN_Msk

/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define RCM_LPAHB2_SUPPORT

/********************  Bit definition for RCM_LPAHB2CLKEN register  *************/
#define RCM_LPAHB2CLKEN_SMCEN_Pos                                   (1U)
#define RCM_LPAHB2CLKEN_SMCEN_Msk                                   (0x1UL << RCM_LPAHB2CLKEN_SMCEN_Pos)                           /*!< 0x00000002 */
#define RCM_LPAHB2CLKEN_SMCEN                                       RCM_LPAHB2CLKEN_SMCEN_Msk
#define RCM_LPAHB2CLKEN_QSPIEN_Pos                                  (2U)
#define RCM_LPAHB2CLKEN_QSPIEN_Msk                                  (0x1UL << RCM_LPAHB2CLKEN_QSPIEN_Pos)                          /*!< 0x00000004 */
#define RCM_LPAHB2CLKEN_QSPIEN                                      RCM_LPAHB2CLKEN_QSPIEN_Msk
#define RCM_LPAHB2CLKEN_RNGEN_Pos                                   (6U)
#define RCM_LPAHB2CLKEN_RNGEN_Msk                                   (0x1UL << RCM_LPAHB2CLKEN_RNGEN_Pos)                           /*!< 0x00000040 */
#define RCM_LPAHB2CLKEN_RNGEN                                       RCM_LPAHB2CLKEN_RNGEN_Msk
#define RCM_LPAHB2CLKEN_OTGFSEN_Pos                                 (7U)
#define RCM_LPAHB2CLKEN_OTGFSEN_Msk                                 (0x1UL << RCM_LPAHB2CLKEN_OTGFSEN_Pos)                         /*!< 0x00000080 */
#define RCM_LPAHB2CLKEN_OTGFSEN                                     RCM_LPAHB2CLKEN_OTGFSEN_Msk

/*
 * @brief Specific device feature definitions (not present on all devices in the APM32F4 serie)
 */
#define RCM_LPAPB1_SUPPORT

/********************  Bit definition for RCM_LPAPB1CLKEN register  *************/
#define RCM_LPAPB1CLKEN_TMR2EN_Pos                                  (0U)
#define RCM_LPAPB1CLKEN_TMR2EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_TMR2EN_Pos)                          /*!< 0x00000001 */
#define RCM_LPAPB1CLKEN_TMR2EN                                      RCM_LPAPB1CLKEN_TMR2EN_Msk
#define RCM_LPAPB1CLKEN_TMR3EN_Pos                                  (1U)
#define RCM_LPAPB1CLKEN_TMR3EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_TMR3EN_Pos)                          /*!< 0x00000002 */
#define RCM_LPAPB1CLKEN_TMR3EN                                      RCM_LPAPB1CLKEN_TMR3EN_Msk
#define RCM_LPAPB1CLKEN_TMR4EN_Pos                                  (2U)
#define RCM_LPAPB1CLKEN_TMR4EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_TMR4EN_Pos)                          /*!< 0x00000004 */
#define RCM_LPAPB1CLKEN_TMR4EN                                      RCM_LPAPB1CLKEN_TMR4EN_Msk
#define RCM_LPAPB1CLKEN_TMR5EN_Pos                                  (3U)
#define RCM_LPAPB1CLKEN_TMR5EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_TMR5EN_Pos)                          /*!< 0x00000008 */
#define RCM_LPAPB1CLKEN_TMR5EN                                      RCM_LPAPB1CLKEN_TMR5EN_Msk
#define RCM_LPAPB1CLKEN_TMR12EN_Pos                                 (6U)
#define RCM_LPAPB1CLKEN_TMR12EN_Msk                                 (0x1UL << RCM_LPAPB1CLKEN_TMR12EN_Pos)                         /*!< 0x00000040 */
#define RCM_LPAPB1CLKEN_TMR12EN                                     RCM_LPAPB1CLKEN_TMR12EN_Msk
#define RCM_LPAPB1CLKEN_TMR13EN_Pos                                 (7U)
#define RCM_LPAPB1CLKEN_TMR13EN_Msk                                 (0x1UL << RCM_LPAPB1CLKEN_TMR13EN_Pos)                         /*!< 0x00000080 */
#define RCM_LPAPB1CLKEN_TMR13EN                                     RCM_LPAPB1CLKEN_TMR13EN_Msk
#define RCM_LPAPB1CLKEN_TMR14EN_Pos                                 (8U)
#define RCM_LPAPB1CLKEN_TMR14EN_Msk                                 (0x1UL << RCM_LPAPB1CLKEN_TMR14EN_Pos)                         /*!< 0x00000100 */
#define RCM_LPAPB1CLKEN_TMR14EN                                     RCM_LPAPB1CLKEN_TMR14EN_Msk
#define RCM_LPAPB1CLKEN_WWDTEN_Pos                                  (11U)
#define RCM_LPAPB1CLKEN_WWDTEN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_WWDTEN_Pos)                          /*!< 0x00000800 */
#define RCM_LPAPB1CLKEN_WWDTEN                                      RCM_LPAPB1CLKEN_WWDTEN_Msk
#define RCM_LPAPB1CLKEN_SPI2EN_Pos                                  (14U)
#define RCM_LPAPB1CLKEN_SPI2EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_SPI2EN_Pos)                          /*!< 0x00004000 */
#define RCM_LPAPB1CLKEN_SPI2EN                                      RCM_LPAPB1CLKEN_SPI2EN_Msk
#define RCM_LPAPB1CLKEN_SPI3EN_Pos                                  (15U)
#define RCM_LPAPB1CLKEN_SPI3EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_SPI3EN_Pos)                          /*!< 0x00008000 */
#define RCM_LPAPB1CLKEN_SPI3EN                                      RCM_LPAPB1CLKEN_SPI3EN_Msk
#define RCM_LPAPB1CLKEN_USART2EN_Pos                                (17U)
#define RCM_LPAPB1CLKEN_USART2EN_Msk                                (0x1UL << RCM_LPAPB1CLKEN_USART2EN_Pos)                        /*!< 0x00020000 */
#define RCM_LPAPB1CLKEN_USART2EN                                    RCM_LPAPB1CLKEN_USART2EN_Msk
#define RCM_LPAPB1CLKEN_USART3EN_Pos                                (18U)
#define RCM_LPAPB1CLKEN_USART3EN_Msk                                (0x1UL << RCM_LPAPB1CLKEN_USART3EN_Pos)                        /*!< 0x00040000 */
#define RCM_LPAPB1CLKEN_USART3EN                                    RCM_LPAPB1CLKEN_USART3EN_Msk
#define RCM_LPAPB1CLKEN_UART4EN_Pos                                 (19U)
#define RCM_LPAPB1CLKEN_UART4EN_Msk                                 (0x1UL << RCM_LPAPB1CLKEN_UART4EN_Pos)                         /*!< 0x00080000 */
#define RCM_LPAPB1CLKEN_UART4EN                                     RCM_LPAPB1CLKEN_UART4EN_Msk
#define RCM_LPAPB1CLKEN_UART5EN_Pos                                 (20U)
#define RCM_LPAPB1CLKEN_UART5EN_Msk                                 (0x1UL << RCM_LPAPB1CLKEN_UART5EN_Pos)                         /*!< 0x00100000 */
#define RCM_LPAPB1CLKEN_UART5EN                                     RCM_LPAPB1CLKEN_UART5EN_Msk
#define RCM_LPAPB1CLKEN_I2C1EN_Pos                                  (21U)
#define RCM_LPAPB1CLKEN_I2C1EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_I2C1EN_Pos)                          /*!< 0x00200000 */
#define RCM_LPAPB1CLKEN_I2C1EN                                      RCM_LPAPB1CLKEN_I2C1EN_Msk
#define RCM_LPAPB1CLKEN_I2C2EN_Pos                                  (22U)
#define RCM_LPAPB1CLKEN_I2C2EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_I2C2EN_Pos)                          /*!< 0x00400000 */
#define RCM_LPAPB1CLKEN_I2C2EN                                      RCM_LPAPB1CLKEN_I2C2EN_Msk
#define RCM_LPAPB1CLKEN_I2C3EN_Pos                                  (23U)
#define RCM_LPAPB1CLKEN_I2C3EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_I2C3EN_Pos)                          /*!< 0x00800000 */
#define RCM_LPAPB1CLKEN_I2C3EN                                      RCM_LPAPB1CLKEN_I2C3EN_Msk
#define RCM_LPAPB1CLKEN_CAN1EN_Pos                                  (25U)
#define RCM_LPAPB1CLKEN_CAN1EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_CAN1EN_Pos)                          /*!< 0x02000000 */
#define RCM_LPAPB1CLKEN_CAN1EN                                      RCM_LPAPB1CLKEN_CAN1EN_Msk
#define RCM_LPAPB1CLKEN_CAN2EN_Pos                                  (26U)
#define RCM_LPAPB1CLKEN_CAN2EN_Msk                                  (0x1UL << RCM_LPAPB1CLKEN_CAN2EN_Pos)                          /*!< 0x04000000 */
#define RCM_LPAPB1CLKEN_CAN2EN                                      RCM_LPAPB1CLKEN_CAN2EN_Msk
#define RCM_LPAPB1CLKEN_PMUEN_Pos                                   (28U)
#define RCM_LPAPB1CLKEN_PMUEN_Msk                                   (0x1UL << RCM_LPAPB1CLKEN_PMUEN_Pos)                           /*!< 0x10000000 */
#define RCM_LPAPB1CLKEN_PMUEN                                       RCM_LPAPB1CLKEN_PMUEN_Msk

