betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
/*******************  Bit definition for SPI_CTRL2 register  ********************/
#define SPI_CTRL2_RXDEN_Pos                                         (0U)
#define SPI_CTRL2_RXDEN_Msk                                         (0x1UL << SPI_CTRL2_RXDEN_Pos)                                 /*!< 0x00000001 */
#define SPI_CTRL2_RXDEN                                             SPI_CTRL2_RXDEN_Msk                                            /*!<Rx Buffer DMA Enable                 */
#define SPI_CTRL2_TXDEN_Pos                                         (1U)
#define SPI_CTRL2_TXDEN_Msk                                         (0x1UL << SPI_CTRL2_TXDEN_Pos)                                 /*!< 0x00000002 */
#define SPI_CTRL2_TXDEN                                             SPI_CTRL2_TXDEN_Msk                                            /*!<Tx Buffer DMA Enable                 */
#define SPI_CTRL2_SSOEN_Pos                                         (2U)
#define SPI_CTRL2_SSOEN_Msk                                         (0x1UL << SPI_CTRL2_SSOEN_Pos)                                 /*!< 0x00000004 */
#define SPI_CTRL2_SSOEN                                             SPI_CTRL2_SSOEN_Msk                                            /*!<SS Output Enable                     */
#define SPI_CTRL2_FRFCFG_Pos                                        (4U)
#define SPI_CTRL2_FRFCFG_Msk                                        (0x1UL << SPI_CTRL2_FRFCFG_Pos)                                /*!< 0x00000010 */
#define SPI_CTRL2_FRFCFG                                            SPI_CTRL2_FRFCFG_Msk                                           /*!<Frame Format                         */
#define SPI_CTRL2_ERRIEN_Pos                                        (5U)
#define SPI_CTRL2_ERRIEN_Msk                                        (0x1UL << SPI_CTRL2_ERRIEN_Pos)                                /*!< 0x00000020 */
#define SPI_CTRL2_ERRIEN                                            SPI_CTRL2_ERRIEN_Msk                                           /*!<Error Interrupt Enable               */
#define SPI_CTRL2_RXBNEIEN_Pos                                      (6U)
#define SPI_CTRL2_RXBNEIEN_Msk                                      (0x1UL << SPI_CTRL2_RXBNEIEN_Pos)                              /*!< 0x00000040 */
#define SPI_CTRL2_RXBNEIEN                                          SPI_CTRL2_RXBNEIEN_Msk                                         /*!<RX buffer Not Empty Interrupt Enable */
#define SPI_CTRL2_TXBEIEN_Pos                                       (7U)
#define SPI_CTRL2_TXBEIEN_Msk                                       (0x1UL << SPI_CTRL2_TXBEIEN_Pos)                               /*!< 0x00000080 */
#define SPI_CTRL2_TXBEIEN                                           SPI_CTRL2_TXBEIEN_Msk                                          /*!<Tx buffer Empty Interrupt Enable     */

/********************  Bit definition for SPI_STS register  ********************/
#define SPI_STS_RXBNEFLG_Pos                                        (0U)
#define SPI_STS_RXBNEFLG_Msk                                        (0x1UL << SPI_STS_RXBNEFLG_Pos)                                /*!< 0x00000001 */
#define SPI_STS_RXBNEFLG                                            SPI_STS_RXBNEFLG_Msk                                           /*!<Receive buffer Not Empty */
#define SPI_STS_TXBEFLG_Pos                                         (1U)
#define SPI_STS_TXBEFLG_Msk                                         (0x1UL << SPI_STS_TXBEFLG_Pos)                                 /*!< 0x00000002 */
#define SPI_STS_TXBEFLG                                             SPI_STS_TXBEFLG_Msk                                            /*!<Transmit buffer Empty    */
#define SPI_STS_SCHDIR_Pos                                          (2U)
#define SPI_STS_SCHDIR_Msk                                          (0x1UL << SPI_STS_SCHDIR_Pos)                                  /*!< 0x00000004 */
#define SPI_STS_SCHDIR                                              SPI_STS_SCHDIR_Msk                                             /*!<Channel side             */
#define SPI_STS_UDRFLG_Pos                                          (3U)
#define SPI_STS_UDRFLG_Msk                                          (0x1UL << SPI_STS_UDRFLG_Pos)                                  /*!< 0x00000008 */
#define SPI_STS_UDRFLG                                              SPI_STS_UDRFLG_Msk                                             /*!<Underrun flag            */
#define SPI_STS_CRCEFLG_Pos                                         (4U)
#define SPI_STS_CRCEFLG_Msk                                         (0x1UL << SPI_STS_CRCEFLG_Pos)                                 /*!< 0x00000010 */
#define SPI_STS_CRCEFLG                                             SPI_STS_CRCEFLG_Msk                                            /*!<CRC Error flag           */
#define SPI_STS_MEFLG_Pos                                           (5U)
#define SPI_STS_MEFLG_Msk                                           (0x1UL << SPI_STS_MEFLG_Pos)                                   /*!< 0x00000020 */
#define SPI_STS_MEFLG                                               SPI_STS_MEFLG_Msk                                              /*!<Mode fault               */
#define SPI_STS_OVRFLG_Pos                                          (6U)
#define SPI_STS_OVRFLG_Msk                                          (0x1UL << SPI_STS_OVRFLG_Pos)                                  /*!< 0x00000040 */
#define SPI_STS_OVRFLG                                              SPI_STS_OVRFLG_Msk                                             /*!<Overrun flag             */
#define SPI_STS_BSYFLG_Pos                                          (7U)
#define SPI_STS_BSYFLG_Msk                                          (0x1UL << SPI_STS_BSYFLG_Pos)                                  /*!< 0x00000080 */
#define SPI_STS_BSYFLG                                              SPI_STS_BSYFLG_Msk                                             /*!<Busy flag                */
#define SPI_STS_FFERR_Pos                                           (8U)
#define SPI_STS_FFERR_Msk                                           (0x1UL << SPI_STS_FFERR_Pos)                                   /*!< 0x00000100 */
#define SPI_STS_FFERR                                               SPI_STS_FFERR_Msk                                              /*!<Frame format error flag  */

/********************  Bit definition for SPI_DATA register  ********************/
#define SPI_DATA_DATA_Pos                                           (0U)
#define SPI_DATA_DATA_Msk                                           (0xFFFFUL << SPI_DATA_DATA_Pos)                                /*!< 0x0000FFFF */
#define SPI_DATA_DATA                                               SPI_DATA_DATA_Msk                                              /*!<Data Register           */

