betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
#define TMR_CCM2_OC4MOD_Pos                                         (12U)
#define TMR_CCM2_OC4MOD_Msk                                         (0x7UL << TMR_CCM2_OC4MOD_Pos)                                 /*!< 0x00007000 */
#define TMR_CCM2_OC4MOD                                             TMR_CCM2_OC4MOD_Msk                                            /*!<OC4M[2:0] bits (Output Compare 4 Mode) */
#define TMR_CCM2_OC4MOD_0                                           (0x1UL << TMR_CCM2_OC4MOD_Pos)                                 /*!< 0x1000 */
#define TMR_CCM2_OC4MOD_1                                           (0x2UL << TMR_CCM2_OC4MOD_Pos)                                 /*!< 0x2000 */
#define TMR_CCM2_OC4MOD_2                                           (0x4UL << TMR_CCM2_OC4MOD_Pos)                                 /*!< 0x4000 */

#define TMR_CCM2_OC4CEN_Pos                                         (15U)
#define TMR_CCM2_OC4CEN_Msk                                         (0x1UL << TMR_CCM2_OC4CEN_Pos)                                 /*!< 0x00008000 */
#define TMR_CCM2_OC4CEN                                             TMR_CCM2_OC4CEN_Msk                                            /*!<Output Compare 4 Clear Enable */

/*----------------------------------------------------------------------------*/

#define TMR_CCM2_IC3PSC_Pos                                         (2U)
#define TMR_CCM2_IC3PSC_Msk                                         (0x3UL << TMR_CCM2_IC3PSC_Pos)                                 /*!< 0x0000000C */
#define TMR_CCM2_IC3PSC                                             TMR_CCM2_IC3PSC_Msk                                            /*!<IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
#define TMR_CCM2_IC3PSC_0                                           (0x1UL << TMR_CCM2_IC3PSC_Pos)                                 /*!< 0x0004 */
#define TMR_CCM2_IC3PSC_1                                           (0x2UL << TMR_CCM2_IC3PSC_Pos)                                 /*!< 0x0008 */

#define TMR_CCM2_IC3F_Pos                                           (4U)
#define TMR_CCM2_IC3F_Msk                                           (0xFUL << TMR_CCM2_IC3F_Pos)                                   /*!< 0x000000F0 */
#define TMR_CCM2_IC3F                                               TMR_CCM2_IC3F_Msk                                              /*!<IC3F[3:0] bits (Input Capture 3 Filter) */
#define TMR_CCM2_IC3F_0                                             (0x1UL << TMR_CCM2_IC3F_Pos)                                   /*!< 0x0010 */
#define TMR_CCM2_IC3F_1                                             (0x2UL << TMR_CCM2_IC3F_Pos)                                   /*!< 0x0020 */
#define TMR_CCM2_IC3F_2                                             (0x4UL << TMR_CCM2_IC3F_Pos)                                   /*!< 0x0040 */
#define TMR_CCM2_IC3F_3                                             (0x8UL << TMR_CCM2_IC3F_Pos)                                   /*!< 0x0080 */

#define TMR_CCM2_IC4PSC_Pos                                         (10U)
#define TMR_CCM2_IC4PSC_Msk                                         (0x3UL << TMR_CCM2_IC4PSC_Pos)                                 /*!< 0x00000C00 */
#define TMR_CCM2_IC4PSC                                             TMR_CCM2_IC4PSC_Msk                                            /*!<IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
#define TMR_CCM2_IC4PSC_0                                           (0x1UL << TMR_CCM2_IC4PSC_Pos)                                 /*!< 0x0400 */
#define TMR_CCM2_IC4PSC_1                                           (0x2UL << TMR_CCM2_IC4PSC_Pos)                                 /*!< 0x0800 */

#define TMR_CCM2_IC4F_Pos                                           (12U)
#define TMR_CCM2_IC4F_Msk                                           (0xFUL << TMR_CCM2_IC4F_Pos)                                   /*!< 0x0000F000 */
#define TMR_CCM2_IC4F                                               TMR_CCM2_IC4F_Msk                                              /*!<IC4F[3:0] bits (Input Capture 4 Filter) */
#define TMR_CCM2_IC4F_0                                             (0x1UL << TMR_CCM2_IC4F_Pos)                                   /*!< 0x1000 */
#define TMR_CCM2_IC4F_1                                             (0x2UL << TMR_CCM2_IC4F_Pos)                                   /*!< 0x2000 */
#define TMR_CCM2_IC4F_2                                             (0x4UL << TMR_CCM2_IC4F_Pos)                                   /*!< 0x4000 */
#define TMR_CCM2_IC4F_3                                             (0x8UL << TMR_CCM2_IC4F_Pos)                                   /*!< 0x8000 */

/*******************  Bit definition for TMR_CCEN register  *******************/
#define TMR_CCEN_CC1EN_Pos                                          (0U)
#define TMR_CCEN_CC1EN_Msk                                          (0x1UL << TMR_CCEN_CC1EN_Pos)                                  /*!< 0x00000001 */
#define TMR_CCEN_CC1EN                                              TMR_CCEN_CC1EN_Msk                                             /*!<Capture/Compare 1 output enable                 */
#define TMR_CCEN_CC1POL_Pos                                         (1U)
#define TMR_CCEN_CC1POL_Msk                                         (0x1UL << TMR_CCEN_CC1POL_Pos)                                 /*!< 0x00000002 */
#define TMR_CCEN_CC1POL                                             TMR_CCEN_CC1POL_Msk                                            /*!<Capture/Compare 1 output Polarity               */
#define TMR_CCEN_CC1NEN_Pos                                         (2U)
#define TMR_CCEN_CC1NEN_Msk                                         (0x1UL << TMR_CCEN_CC1NEN_Pos)                                 /*!< 0x00000004 */
#define TMR_CCEN_CC1NEN                                             TMR_CCEN_CC1NEN_Msk                                            /*!<Capture/Compare 1 Complementary output enable   */
#define TMR_CCEN_CC1NPOL_Pos                                        (3U)
#define TMR_CCEN_CC1NPOL_Msk                                        (0x1UL << TMR_CCEN_CC1NPOL_Pos)                                /*!< 0x00000008 */
#define TMR_CCEN_CC1NPOL                                            TMR_CCEN_CC1NPOL_Msk                                           /*!<Capture/Compare 1 Complementary output Polarity */
#define TMR_CCEN_CC2EN_Pos                                          (4U)
#define TMR_CCEN_CC2EN_Msk                                          (0x1UL << TMR_CCEN_CC2EN_Pos)                                  /*!< 0x00000010 */
#define TMR_CCEN_CC2EN                                              TMR_CCEN_CC2EN_Msk                                             /*!<Capture/Compare 2 output enable                 */
#define TMR_CCEN_CC2POL_Pos                                         (5U)
#define TMR_CCEN_CC2POL_Msk                                         (0x1UL << TMR_CCEN_CC2POL_Pos)                                 /*!< 0x00000020 */
#define TMR_CCEN_CC2POL                                             TMR_CCEN_CC2POL_Msk                                            /*!<Capture/Compare 2 output Polarity               */
#define TMR_CCEN_CC2NEN_Pos                                         (6U)
#define TMR_CCEN_CC2NEN_Msk                                         (0x1UL << TMR_CCEN_CC2NEN_Pos)                                 /*!< 0x00000040 */
#define TMR_CCEN_CC2NEN                                             TMR_CCEN_CC2NEN_Msk                                            /*!<Capture/Compare 2 Complementary output enable   */
#define TMR_CCEN_CC2NPOL_Pos                                        (7U)
#define TMR_CCEN_CC2NPOL_Msk                                        (0x1UL << TMR_CCEN_CC2NPOL_Pos)                                /*!< 0x00000080 */
#define TMR_CCEN_CC2NPOL                                            TMR_CCEN_CC2NPOL_Msk                                           /*!<Capture/Compare 2 Complementary output Polarity */
#define TMR_CCEN_CC3EN_Pos                                          (8U)
#define TMR_CCEN_CC3EN_Msk                                          (0x1UL << TMR_CCEN_CC3EN_Pos)                                  /*!< 0x00000100 */
#define TMR_CCEN_CC3EN                                              TMR_CCEN_CC3EN_Msk                                             /*!<Capture/Compare 3 output enable                 */
#define TMR_CCEN_CC3POL_Pos                                         (9U)
#define TMR_CCEN_CC3POL_Msk                                         (0x1UL << TMR_CCEN_CC3POL_Pos)                                 /*!< 0x00000200 */
#define TMR_CCEN_CC3POL                                             TMR_CCEN_CC3POL_Msk                                            /*!<Capture/Compare 3 output Polarity               */
#define TMR_CCEN_CC3NEN_Pos                                         (10U)
#define TMR_CCEN_CC3NEN_Msk                                         (0x1UL << TMR_CCEN_CC3NEN_Pos)                                 /*!< 0x00000400 */
#define TMR_CCEN_CC3NEN                                             TMR_CCEN_CC3NEN_Msk                                            /*!<Capture/Compare 3 Complementary output enable   */
#define TMR_CCEN_CC3NPOL_Pos                                        (11U)
#define TMR_CCEN_CC3NPOL_Msk                                        (0x1UL << TMR_CCEN_CC3NPOL_Pos)                                /*!< 0x00000800 */
#define TMR_CCEN_CC3NPOL                                            TMR_CCEN_CC3NPOL_Msk                                           /*!<Capture/Compare 3 Complementary output Polarity */
#define TMR_CCEN_CC4EN_Pos                                          (12U)
#define TMR_CCEN_CC4EN_Msk                                          (0x1UL << TMR_CCEN_CC4EN_Pos)                                  /*!< 0x00001000 */
#define TMR_CCEN_CC4EN                                              TMR_CCEN_CC4EN_Msk                                             /*!<Capture/Compare 4 output enable                 */
#define TMR_CCEN_CC4POL_Pos                                         (13U)
#define TMR_CCEN_CC4POL_Msk                                         (0x1UL << TMR_CCEN_CC4POL_Pos)                                 /*!< 0x00002000 */
#define TMR_CCEN_CC4POL                                             TMR_CCEN_CC4POL_Msk                                            /*!<Capture/Compare 4 output Polarity               */
#define TMR_CCEN_CC4NPOL_Pos                                        (15U)
#define TMR_CCEN_CC4NPOL_Msk                                        (0x1UL << TMR_CCEN_CC4NPOL_Pos)                                /*!< 0x00008000 */
#define TMR_CCEN_CC4NPOL                                            TMR_CCEN_CC4NPOL_Msk                                           /*!<Capture/Compare 4 Complementary output Polarity */

