betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
/********************  Bit definition for DBGMCU_CFG register  *****************/
#define DBGMCU_CFG_SLEEP_CLK_STS_Pos                                (0U)
#define DBGMCU_CFG_SLEEP_CLK_STS_Msk                                (0x1UL << DBGMCU_CFG_SLEEP_CLK_STS_Pos)                        /*!< 0x00000001 */
#define DBGMCU_CFG_SLEEP_CLK_STS                                    DBGMCU_CFG_SLEEP_CLK_STS_Msk
#define DBGMCU_CFG_STOP_CLK_STS_Pos                                 (1U)
#define DBGMCU_CFG_STOP_CLK_STS_Msk                                 (0x1UL << DBGMCU_CFG_STOP_CLK_STS_Pos)                         /*!< 0x00000002 */
#define DBGMCU_CFG_STOP_CLK_STS                                     DBGMCU_CFG_STOP_CLK_STS_Msk
#define DBGMCU_CFG_STANDBY_CLK_STS_Pos                              (2U)
#define DBGMCU_CFG_STANDBY_CLK_STS_Msk                              (0x1UL << DBGMCU_CFG_STANDBY_CLK_STS_Pos)                      /*!< 0x00000004 */
#define DBGMCU_CFG_STANDBY_CLK_STS                                  DBGMCU_CFG_STANDBY_CLK_STS_Msk
#define DBGMCU_CFG_TRACE_IOEN_Pos                                   (5U)
#define DBGMCU_CFG_TRACE_IOEN_Msk                                   (0x1UL << DBGMCU_CFG_TRACE_IOEN_Pos)                           /*!< 0x00000020 */
#define DBGMCU_CFG_TRACE_IOEN                                       DBGMCU_CFG_TRACE_IOEN_Msk

#define DBGMCU_CFG_TRACE_MODE_Pos                                   (6U)
#define DBGMCU_CFG_TRACE_MODE_Msk                                   (0x3UL << DBGMCU_CFG_TRACE_MODE_Pos)                           /*!< 0x000000C0 */
#define DBGMCU_CFG_TRACE_MODE                                       DBGMCU_CFG_TRACE_MODE_Msk
#define DBGMCU_CFG_TRACE_MODE_0                                     (0x1UL << DBGMCU_CFG_TRACE_MODE_Pos)                           /*!< 0x00000040 */
#define DBGMCU_CFG_TRACE_MODE_1                                     (0x2UL << DBGMCU_CFG_TRACE_MODE_Pos)                           /*!< 0x00000080 */

/********************  Bit definition for DBGMCU_APB1_FZ register  ************/
#define DBGMCU_APB1F_TMR2_STS_Pos                                   (0U)
#define DBGMCU_APB1F_TMR2_STS_Msk                                   (0x1UL << DBGMCU_APB1F_TMR2_STS_Pos)                           /*!< 0x00000001 */
#define DBGMCU_APB1F_TMR2_STS                                       DBGMCU_APB1F_TMR2_STS_Msk
#define DBGMCU_APB1F_TMR3_STS_Pos                                   (1U)
#define DBGMCU_APB1F_TMR3_STS_Msk                                   (0x1UL << DBGMCU_APB1F_TMR3_STS_Pos)                           /*!< 0x00000002 */
#define DBGMCU_APB1F_TMR3_STS                                       DBGMCU_APB1F_TMR3_STS_Msk
#define DBGMCU_APB1F_TMR4_STS_Pos                                   (2U)
#define DBGMCU_APB1F_TMR4_STS_Msk                                   (0x1UL << DBGMCU_APB1F_TMR4_STS_Pos)                           /*!< 0x00000004 */
#define DBGMCU_APB1F_TMR4_STS                                       DBGMCU_APB1F_TMR4_STS_Msk
#define DBGMCU_APB1F_TMR5_STS_Pos                                   (3U)
#define DBGMCU_APB1F_TMR5_STS_Msk                                   (0x1UL << DBGMCU_APB1F_TMR5_STS_Pos)                           /*!< 0x00000008 */
#define DBGMCU_APB1F_TMR5_STS                                       DBGMCU_APB1F_TMR5_STS_Msk
#define DBGMCU_APB1F_TMR12_STS_Pos                                  (6U)
#define DBGMCU_APB1F_TMR12_STS_Msk                                  (0x1UL << DBGMCU_APB1F_TMR12_STS_Pos)                          /*!< 0x00000040 */
#define DBGMCU_APB1F_TMR12_STS                                      DBGMCU_APB1F_TMR12_STS_Msk
#define DBGMCU_APB1F_TMR13_STS_Pos                                  (7U)
#define DBGMCU_APB1F_TMR13_STS_Msk                                  (0x1UL << DBGMCU_APB1F_TMR13_STS_Pos)                          /*!< 0x00000080 */
#define DBGMCU_APB1F_TMR13_STS                                      DBGMCU_APB1F_TMR13_STS_Msk
#define DBGMCU_APB1F_TMR14_STS_Pos                                  (8U)
#define DBGMCU_APB1F_TMR14_STS_Msk                                  (0x1UL << DBGMCU_APB1F_TMR14_STS_Pos)                          /*!< 0x00000100 */
#define DBGMCU_APB1F_TMR14_STS                                      DBGMCU_APB1F_TMR14_STS_Msk
#define DBGMCU_APB1F_RTC_STS_Pos                                    (10U)
#define DBGMCU_APB1F_RTC_STS_Msk                                    (0x1UL << DBGMCU_APB1F_RTC_STS_Pos)                            /*!< 0x00000400 */
#define DBGMCU_APB1F_RTC_STS                                        DBGMCU_APB1F_RTC_STS_Msk
#define DBGMCU_APB1F_WWDT_STS_Pos                                   (11U)
#define DBGMCU_APB1F_WWDT_STS_Msk                                   (0x1UL << DBGMCU_APB1F_WWDT_STS_Pos)                           /*!< 0x00000800 */
#define DBGMCU_APB1F_WWDT_STS                                       DBGMCU_APB1F_WWDT_STS_Msk
#define DBGMCU_APB1F_IWDT_STS_Pos                                   (12U)
#define DBGMCU_APB1F_IWDT_STS_Msk                                   (0x1UL << DBGMCU_APB1F_IWDT_STS_Pos)                           /*!< 0x00001000 */
#define DBGMCU_APB1F_IWDT_STS                                       DBGMCU_APB1F_IWDT_STS_Msk
#define DBGMCU_APB1F_I2C1_SMBUS_TIMEOUT_STS_Pos                     (21U)
#define DBGMCU_APB1F_I2C1_SMBUS_TIMEOUT_STS_Msk                     (0x1UL << DBGMCU_APB1F_I2C1_SMBUS_TIMEOUT_STS_Pos)             /*!< 0x00200000 */
#define DBGMCU_APB1F_I2C1_SMBUS_TIMEOUT_STS                         DBGMCU_APB1F_I2C1_SMBUS_TIMEOUT_STS_Msk
#define DBGMCU_APB1F_I2C2_SMBUS_TIMEOUT_STS_Pos                     (22U)
#define DBGMCU_APB1F_I2C2_SMBUS_TIMEOUT_STS_Msk                     (0x1UL << DBGMCU_APB1F_I2C2_SMBUS_TIMEOUT_STS_Pos)             /*!< 0x00400000 */
#define DBGMCU_APB1F_I2C2_SMBUS_TIMEOUT_STS                         DBGMCU_APB1F_I2C2_SMBUS_TIMEOUT_STS_Msk
#define DBGMCU_APB1F_I2C3_SMBUS_TIMEOUT_STS_Pos                     (23U)
#define DBGMCU_APB1F_I2C3_SMBUS_TIMEOUT_STS_Msk                     (0x1UL << DBGMCU_APB1F_I2C3_SMBUS_TIMEOUT_STS_Pos)             /*!< 0x00800000 */
#define DBGMCU_APB1F_I2C3_SMBUS_TIMEOUT_STS                         DBGMCU_APB1F_I2C3_SMBUS_TIMEOUT_STS_Msk
#define DBGMCU_APB1F_CAN1_STS_Pos                                   (25U)
#define DBGMCU_APB1F_CAN1_STS_Msk                                   (0x1UL << DBGMCU_APB1F_CAN1_STS_Pos)                           /*!< 0x02000000 */
#define DBGMCU_APB1F_CAN1_STS                                       DBGMCU_APB1F_CAN1_STS_Msk
#define DBGMCU_APB1F_CAN2_STS_Pos                                   (26U)
#define DBGMCU_APB1F_CAN2_STS_Msk                                   (0x1UL << DBGMCU_APB1F_CAN2_STS_Pos)                           /*!< 0x04000000 */
#define DBGMCU_APB1F_CAN2_STS                                       DBGMCU_APB1F_CAN2_STS_Msk
/* Old IWDTSTOP bit definition, maintained for legacy purpose */
#define DBGMCU_APB1F_IWDEG_STOP                                     DBGMCU_APB1F_IWDT_STS

