betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
/*****************  Bit definition for QSPI_RFUIC register  ******************/
#define QSPI_RFUIC_RFUIC_Pos                                        (0U)
#define QSPI_RFUIC_RFUIC_Msk                                        (0x1UL << QSPI_RFUIC_RFUIC_Pos)                                /*!< 0x00000001 */
#define QSPI_RFUIC_RFUIC                                            QSPI_RFUIC_RFUIC_Msk                                           /*!< Receive FIFO Underflow Interrupt Clear */

/*****************  Bit definition for QSPI_MIC register  ********************/
#define QSPI_MIC_MIC_Pos                                            (0U)
#define QSPI_MIC_MIC_Msk                                            (0x1UL << QSPI_MIC_MIC_Pos)                                    /*!< 0x00000001 */
#define QSPI_MIC_MIC                                                QSPI_MIC_MIC_Msk                                               /*!< Multi-Master Contention Interrupt Clear */

/*****************  Bit definition for QSPI_ICF register  ********************/
#define QSPI_ICF_ICF_Pos                                            (0U)
#define QSPI_ICF_ICF_Msk                                            (0x1UL << QSPI_ICF_ICF_Pos)                                    /*!< 0x00000001 */
#define QSPI_ICF_ICF                                                QSPI_ICF_ICF_Msk                                               /*!< Data Collision Error Interrupt Clear */

/*****************  Bit definition for QSPI_DMACTRL register  ****************/
#define QSPI_DMACTRL_RDMAEN_Pos                                     (0U)
#define QSPI_DMACTRL_RDMAEN_Msk                                     (0x1UL << QSPI_DMACTRL_RDMAEN_Pos)                             /*!< 0x00000001 */
#define QSPI_DMACTRL_RDMAEN                                         QSPI_DMACTRL_RDMAEN_Msk                                        /*!< Receive DMA Enable */
#define QSPI_DMACTRL_TDMAEN_Pos                                     (1U)
#define QSPI_DMACTRL_TDMAEN_Msk                                     (0x1UL << QSPI_DMACTRL_TDMAEN_Pos)                             /*!< 0x00000002 */
#define QSPI_DMACTRL_TDMAEN                                         QSPI_DMACTRL_TDMAEN_Msk                                        /*!< Transmit DMA Enable */

/*****************  Bit definition for QSPI_DMATDL register  *****************/
#define QSPI_DMATDL_DMATDL_Pos                                      (0U)
#define QSPI_DMATDL_DMATDL_Msk                                      (0x7UL << QSPI_DMATDL_DMATDL_Pos)                              /*!< 0x00000007 */
#define QSPI_DMATDL_DMATDL                                          QSPI_DMATDL_DMATDL_Msk                                         /*!< DMATDL[2:0] bits (DMA Transmit Data Level) */

/*****************  Bit definition for QSPI_DMARDL register  *****************/
#define QSPI_DMARDL_DMARDL_Pos                                      (0U)
#define QSPI_DMARDL_DMARDL_Msk                                      (0x7UL << QSPI_DMARDL_DMARDL_Pos)                              /*!< 0x00000007 */
#define QSPI_DMARDL_DMARDL                                          QSPI_DMARDL_DMARDL_Msk                                         /*!< DMARDL[2:0] bits (DMA Receive Data Level) */

/*****************  Bit definition for QSPI_DATA register  *******************/
#define QSPI_DATA_DATA_Pos                                          (0U)
#define QSPI_DATA_DATA_Msk                                          (0xFFFFFFFFUL << QSPI_DATA_DATA_Pos)                           /*!< 0xFFFFFFFF */
#define QSPI_DATA_DATA                                              QSPI_DATA_DATA_Msk                                             /*!< Transmit/Receive Data */

/*****************  Bit definition for QSPI_RSD register  ********************/
#define QSPI_RSD_RSD_Pos                                            (0U)
#define QSPI_RSD_RSD_Msk                                            (0xFFUL << QSPI_RSD_RSD_Pos)                                   /*!< 0x000000FF */
#define QSPI_RSD_RSD                                                QSPI_RSD_RSD_Msk                                               /*!< Receive Sample Delay */
#define QSPI_RSD_RSE_Pos                                            (16U)
#define QSPI_RSD_RSE_Msk                                            (0x1UL << QSPI_RSD_RSE_Pos)                                    /*!< 0x00010000 */
#define QSPI_RSD_RSE                                                QSPI_RSD_RSE_Msk                                               /*!< Receive Sample Enable */

/*****************  Bit definition for QSPI_CTRL3 register  ******************/
#define QSPI_CTRL3_IAT_Pos                                          (0U)
#define QSPI_CTRL3_IAT_Msk                                          (0x3UL << QSPI_CTRL3_IAT_Pos)                                  /*!< 0x00000003 */
#define QSPI_CTRL3_IAT                                              QSPI_CTRL3_IAT_Msk                                             /*!< IAT[1:0] bits (Transfer Instruction Address Mode) */
#define QSPI_CTRL3_IAT_0                                            (0x1UL << QSPI_CTRL3_IAT_Pos)                                  /*!< 0x00000001 */
#define QSPI_CTRL3_IAT_1                                            (0x2UL << QSPI_CTRL3_IAT_Pos)                                  /*!< 0x00000002 */
#define QSPI_CTRL3_ADDRLEN_Pos                                      (2U)
#define QSPI_CTRL3_ADDRLEN_Msk                                      (0xFUL << QSPI_CTRL3_ADDRLEN_Pos)                              /*!< 0x0000003C */
#define QSPI_CTRL3_ADDRLEN                                          QSPI_CTRL3_ADDRLEN_Msk                                         /*!< ADDRLEN[3:0] bits (Transfer Address Length) */
#define QSPI_CTRL3_ADDRLEN_0                                        (0x1UL << QSPI_CTRL3_ADDRLEN_Pos)                              /*!< 0x00000004 */
#define QSPI_CTRL3_ADDRLEN_1                                        (0x2UL << QSPI_CTRL3_ADDRLEN_Pos)                              /*!< 0x00000008 */
#define QSPI_CTRL3_ADDRLEN_2                                        (0x4UL << QSPI_CTRL3_ADDRLEN_Pos)                              /*!< 0x00000010 */
#define QSPI_CTRL3_ADDRLEN_3                                        (0x8UL << QSPI_CTRL3_ADDRLEN_Pos)                              /*!< 0x00000020 */
#define QSPI_CTRL3_INSLEN_Pos                                       (8U)
#define QSPI_CTRL3_INSLEN_Msk                                       (0x3UL << QSPI_CTRL3_INSLEN_Pos)                               /*!< 0x00000300 */
#define QSPI_CTRL3_INSLEN                                           QSPI_CTRL3_INSLEN_Msk                                          /*!< INSLEN[1:0] bits (Transfer Instruction Length) */
#define QSPI_CTRL3_INSLEN_0                                         (0x1UL << QSPI_CTRL3_INSLEN_Pos)                               /*!< 0x00000100 */
#define QSPI_CTRL3_INSLEN_1                                         (0x2UL << QSPI_CTRL3_INSLEN_Pos)                               /*!< 0x00000200 */
#define QSPI_CTRL3_WAITCYC_Pos                                      (11U)
#define QSPI_CTRL3_WAITCYC_Msk                                      (0x1FUL << QSPI_CTRL3_WAITCYC_Pos)                             /*!< 0x0000F800 */
#define QSPI_CTRL3_WAITCYC                                          QSPI_CTRL3_WAITCYC_Msk                                         /*!< WAITCYC[4:0] bits (Wait Cycle Number) */
#define QSPI_CTRL3_CSEN_Pos                                         (30U)
#define QSPI_CTRL3_CSEN_Msk                                         (0x1UL << QSPI_CTRL3_CSEN_Pos)                                 /*!< 0x40000000 */
#define QSPI_CTRL3_CSEN                                             QSPI_CTRL3_CSEN_Msk                                            /*!< Clock Stretch Enable */

/*****************  Bit definition for QSPI_IOSW register  *******************/
#define QSPI_IOSW_IOSW_Pos                                          (0U)
#define QSPI_IOSW_IOSW_Msk                                          (0x1UL << QSPI_IOSW_IOSW_Pos)                                  /*!< 0x00000001 */
#define QSPI_IOSW_IOSW                                              QSPI_IOSW_IOSW_Msk                                             /*!< IO Switch */

/******************************************************************************/
/*                                                                            */
/*                             COMP1 and COMP2                                */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for COMP_CSTS register  ******************/
#define COMP_CSTS_EN_Pos                                             (0U)
#define COMP_CSTS_EN_Msk                                             (0x1UL << COMP_CSTS_EN_Pos)                                    /*!< 0x00000001 */
#define COMP_CSTS_EN                                                 COMP_CSTS_EN_Msk                                               /*!< Comparator enable bit */
#define COMP_CSTS_SPEEDM_Pos                                         (3U)
#define COMP_CSTS_SPEEDM_Msk                                         (0x1UL << COMP_CSTS_SPEEDM_Pos)                                /*!< 0x00000008 */
#define COMP_CSTS_SPEEDM                                             COMP_CSTS_SPEEDM_Msk                                           /*!< Comparator speed mode */
#define COMP_CSTS_INMCCFG_Pos                                        (4U)
#define COMP_CSTS_INMCCFG_Msk                                        (0x7UL << COMP_CSTS_INMCCFG_Pos)                               /*!< 0x00000070 */
#define COMP_CSTS_INMCCFG                                            COMP_CSTS_INMCCFG_Msk                                          /*!< INMCCFG[2:0] bits (Comparator Input Minus Connection Configuration) */
#define COMP_CSTS_INMCCFG_0                                          (0x1UL << COMP_CSTS_INMCCFG_Pos)                               /*!< 0x00000010 */
#define COMP_CSTS_INMCCFG_1                                          (0x2UL << COMP_CSTS_INMCCFG_Pos)                               /*!< 0x00000020 */
#define COMP_CSTS_INMCCFG_2                                          (0x4UL << COMP_CSTS_INMCCFG_Pos)                               /*!< 0x00000040 Only for Comparator 2 */
#define COMP_CSTS_WMODESEL_Pos                                       (8U)
#define COMP_CSTS_WMODESEL_Msk                                       (0x1UL << COMP_CSTS_WMODESEL_Pos)                              /*!< 0x00000100 */
#define COMP_CSTS_WMODESEL                                           COMP_CSTS_WMODESEL_Msk                                         /*!< Window mode selection bit Only for Comparator 1 */
#define COMP_CSTS_INPCCFG_Pos                                        (8U)
#define COMP_CSTS_INPCCFG_Msk                                        (0x7UL << COMP_CSTS_INPCCFG_Pos)                               /*!< 0x00000700 */
#define COMP_CSTS_INPCCFG                                            COMP_CSTS_INPCCFG_Msk                                          /*!< INPCCFG[2:0] bits (Comparator 2 Input Plus Connection Configuration) */
#define COMP_CSTS_INPCCFG_0                                          (0x1UL << COMP_CSTS_INPCCFG_Pos)                               /*!< 0x00000100 */
#define COMP_CSTS_INPCCFG_1                                          (0x2UL << COMP_CSTS_INPCCFG_Pos)                               /*!< 0x00000200 */
#define COMP_CSTS_INPCCFG_2                                          (0x4UL << COMP_CSTS_INPCCFG_Pos)                               /*!< 0x00000400 */
#define COMP_CSTS_OUTSEL_Pos                                         (11U)
#define COMP_CSTS_OUTSEL_Msk                                         (0xFUL << COMP_CSTS_OUTSEL_Pos)                                /*!< 0x00007800 */
#define COMP_CSTS_OUTSEL                                             COMP_CSTS_OUTSEL_Msk                                           /*!< OUTSEL[3:0] bits (Comparator output selection) */
#define COMP_CSTS_OUTSEL_0                                           (0x1UL << COMP_CSTS_OUTSEL_Pos)                                /*!< 0x00000800 */
#define COMP_CSTS_OUTSEL_1                                           (0x2UL << COMP_CSTS_OUTSEL_Pos)                                /*!< 0x00001000 */
#define COMP_CSTS_OUTSEL_2                                           (0x4UL << COMP_CSTS_OUTSEL_Pos)                                /*!< 0x00002000 */
#define COMP_CSTS_OUTSEL_3                                           (0x8UL << COMP_CSTS_OUTSEL_Pos)                                /*!< 0x00004000 */
#define COMP_CSTS_POLCFG_Pos                                         (15U)
#define COMP_CSTS_POLCFG_Msk                                         (0x1UL << COMP_CSTS_POLCFG_Pos)                                /*!< 0x00008000 */
#define COMP_CSTS_POLCFG                                             COMP_CSTS_POLCFG_Msk                                           /*!< Polarity configuration bit */
#define COMP_CSTS_OUTVAL_Pos                                         (30U)
#define COMP_CSTS_OUTVAL_Msk                                         (0x1UL << COMP_CSTS_OUTVAL_Pos)                                /*!< 0x40000000 */
#define COMP_CSTS_OUTVAL                                             COMP_CSTS_OUTVAL_Msk                                           /*!< Comparator output status bit */
#define COMP_CSTS_LOCK_Pos                                           (31U)
#define COMP_CSTS_LOCK_Msk                                           (0x1UL << COMP_CSTS_LOCK_Pos)                                  /*!< 0x80000000 */
#define COMP_CSTS_LOCK                                               COMP_CSTS_LOCK_Msk                                             /*!< COMP_CSTS register lock bit */

/******************************************************************************/
/*                                                                            */
/*                                       USB_OTG                              */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for USB_OTG_GCTRLSTS register  ***********/
#define USB_OTG_GCTRLSTS_SREQSUC_Pos                                (0U)
#define USB_OTG_GCTRLSTS_SREQSUC_Msk                                (0x1UL << USB_OTG_GCTRLSTS_SREQSUC_Pos)                        /*!< 0x00000001 */
#define USB_OTG_GCTRLSTS_SREQSUC                                    USB_OTG_GCTRLSTS_SREQSUC_Msk                                   /*!< Session request success */
#define USB_OTG_GCTRLSTS_SREQ_Pos                                   (1U)
#define USB_OTG_GCTRLSTS_SREQ_Msk                                   (0x1UL << USB_OTG_GCTRLSTS_SREQ_Pos)                           /*!< 0x00000002 */
#define USB_OTG_GCTRLSTS_SREQ                                       USB_OTG_GCTRLSTS_SREQ_Msk                                      /*!< Session request */
#define USB_OTG_GCTRLSTS_HNSUC_Pos                                  (8U)
#define USB_OTG_GCTRLSTS_HNSUC_Msk                                  (0x1UL << USB_OTG_GCTRLSTS_HNSUC_Pos)                          /*!< 0x00000100 */
#define USB_OTG_GCTRLSTS_HNSUC                                      USB_OTG_GCTRLSTS_HNSUC_Msk                                     /*!< Host set HNP enable */
#define USB_OTG_GCTRLSTS_HNPREQ_Pos                                 (9U)
#define USB_OTG_GCTRLSTS_HNPREQ_Msk                                 (0x1UL << USB_OTG_GCTRLSTS_HNPREQ_Pos)                         /*!< 0x00000200 */
#define USB_OTG_GCTRLSTS_HNPREQ                                     USB_OTG_GCTRLSTS_HNPREQ_Msk                                    /*!< HNP request */
#define USB_OTG_GCTRLSTS_HHNPEN_Pos                                 (10U)
#define USB_OTG_GCTRLSTS_HHNPEN_Msk                                 (0x1UL << USB_OTG_GCTRLSTS_HHNPEN_Pos)                         /*!< 0x00000400 */
#define USB_OTG_GCTRLSTS_HHNPEN                                     USB_OTG_GCTRLSTS_HHNPEN_Msk                                    /*!< Host set HNP enable */
#define USB_OTG_GCTRLSTS_DHNPEN_Pos                                 (11U)
#define USB_OTG_GCTRLSTS_DHNPEN_Msk                                 (0x1UL << USB_OTG_GCTRLSTS_DHNPEN_Pos)                         /*!< 0x00000800 */
#define USB_OTG_GCTRLSTS_DHNPEN                                     USB_OTG_GCTRLSTS_DHNPEN_Msk                                    /*!< Device HNP enabled */
#define USB_OTG_GCTRLSTS_CIDSTS_Pos                                 (16U)
#define USB_OTG_GCTRLSTS_CIDSTS_Msk                                 (0x1UL << USB_OTG_GCTRLSTS_CIDSTS_Pos)                         /*!< 0x00010000 */
#define USB_OTG_GCTRLSTS_CIDSTS                                     USB_OTG_GCTRLSTS_CIDSTS_Msk                                    /*!< Connector ID status */
#define USB_OTG_GCTRLSTS_LSDEBT_Pos                                 (17U)
#define USB_OTG_GCTRLSTS_LSDEBT_Msk                                 (0x1UL << USB_OTG_GCTRLSTS_LSDEBT_Pos)                         /*!< 0x00020000 */
#define USB_OTG_GCTRLSTS_LSDEBT                                     USB_OTG_GCTRLSTS_LSDEBT_Msk                                    /*!< Long/short debounce time */
#define USB_OTG_GCTRLSTS_ASVD_Pos                                   (18U)
#define USB_OTG_GCTRLSTS_ASVD_Msk                                   (0x1UL << USB_OTG_GCTRLSTS_ASVD_Pos)                           /*!< 0x00040000 */
#define USB_OTG_GCTRLSTS_ASVD                                       USB_OTG_GCTRLSTS_ASVD_Msk                                      /*!< A-session valid  */
#define USB_OTG_GCTRLSTS_BSVD_Pos                                   (19U)
#define USB_OTG_GCTRLSTS_BSVD_Msk                                   (0x1UL << USB_OTG_GCTRLSTS_BSVD_Pos)                           /*!< 0x00080000 */
#define USB_OTG_GCTRLSTS_BSVD                                       USB_OTG_GCTRLSTS_BSVD_Msk                                      /*!< B-session valid */

/********************  Bit definition for USB_OTG_HCFG register  ********************/

#define USB_OTG_HCFG_PHYCLKSEL_Pos                                  (0U)
#define USB_OTG_HCFG_PHYCLKSEL_Msk                                  (0x3UL << USB_OTG_HCFG_PHYCLKSEL_Pos)                          /*!< 0x00000003 */
#define USB_OTG_HCFG_PHYCLKSEL                                      USB_OTG_HCFG_PHYCLKSEL_Msk                                     /*!< FS/LS PHY clock select  */
#define USB_OTG_HCFG_PHYCLKSEL_0                                    (0x1UL << USB_OTG_HCFG_PHYCLKSEL_Pos)                          /*!< 0x00000001 */
#define USB_OTG_HCFG_PHYCLKSEL_1                                    (0x2UL << USB_OTG_HCFG_PHYCLKSEL_Pos)                          /*!< 0x00000002 */
#define USB_OTG_HCFG_FSSPT_Pos                                      (2U)
#define USB_OTG_HCFG_FSSPT_Msk                                      (0x1UL << USB_OTG_HCFG_FSSPT_Pos)                              /*!< 0x00000004 */
#define USB_OTG_HCFG_FSSPT                                          USB_OTG_HCFG_FSSPT_Msk                                         /*!< FS- and LS-only support */

/********************  Bit definition for USB_OTG_DCFG register  ********************/

#define USB_OTG_DCFG_DSPDSEL_Pos                                    (0U)
#define USB_OTG_DCFG_DSPDSEL_Msk                                    (0x3UL << USB_OTG_DCFG_DSPDSEL_Pos)                            /*!< 0x00000003 */
#define USB_OTG_DCFG_DSPDSEL                                        USB_OTG_DCFG_DSPDSEL_Msk                                       /*!< Device speed */
#define USB_OTG_DCFG_DSPDSEL_0                                      (0x1UL << USB_OTG_DCFG_DSPDSEL_Pos)                            /*!< 0x00000001 */
#define USB_OTG_DCFG_DSPDSEL_1                                      (0x2UL << USB_OTG_DCFG_DSPDSEL_Pos)                            /*!< 0x00000002 */
#define USB_OTG_DCFG_SENDOUT_Pos                                    (2U)
#define USB_OTG_DCFG_SENDOUT_Msk                                    (0x1UL << USB_OTG_DCFG_SENDOUT_Pos)                            /*!< 0x00000004 */
#define USB_OTG_DCFG_SENDOUT                                        USB_OTG_DCFG_SENDOUT_Msk                                       /*!< Nonzero-length status OUT handshake */

#define USB_OTG_DCFG_DADDR_Pos                                      (4U)
#define USB_OTG_DCFG_DADDR_Msk                                      (0x7FUL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x000007F0 */
#define USB_OTG_DCFG_DADDR                                          USB_OTG_DCFG_DADDR_Msk                                         /*!< Device address */
#define USB_OTG_DCFG_DADDR_0                                        (0x01UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000010 */
#define USB_OTG_DCFG_DADDR_1                                        (0x02UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000020 */
#define USB_OTG_DCFG_DADDR_2                                        (0x04UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000040 */
#define USB_OTG_DCFG_DADDR_3                                        (0x08UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000080 */
#define USB_OTG_DCFG_DADDR_4                                        (0x10UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000100 */
#define USB_OTG_DCFG_DADDR_5                                        (0x20UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000200 */
#define USB_OTG_DCFG_DADDR_6                                        (0x40UL << USB_OTG_DCFG_DADDR_Pos)                             /*!< 0x00000400 */

#define USB_OTG_DCFG_PFITV_Pos                                      (11U)
#define USB_OTG_DCFG_PFITV_Msk                                      (0x3UL << USB_OTG_DCFG_PFITV_Pos)                              /*!< 0x00001800 */
#define USB_OTG_DCFG_PFITV                                          USB_OTG_DCFG_PFITV_Msk                                         /*!< Periodic (micro)frame interval */
#define USB_OTG_DCFG_PFITV_0                                        (0x1UL << USB_OTG_DCFG_PFITV_Pos)                              /*!< 0x00000800 */
#define USB_OTG_DCFG_PFITV_1                                        (0x2UL << USB_OTG_DCFG_PFITV_Pos)                              /*!< 0x00001000 */

#define USB_OTG_DCFG_XCVRDLY_Pos                                    (14U)
#define USB_OTG_DCFG_XCVRDLY_Msk                                    (0x1UL << USB_OTG_DCFG_XCVRDLY_Pos)                            /*!< 0x00004000 */
#define USB_OTG_DCFG_XCVRDLY                                        USB_OTG_DCFG_XCVRDLY_Msk                                       /*!< Transceiver delay */

#define USB_OTG_DCFG_ERRATMR_Pos                                    (15U)
#define USB_OTG_DCFG_ERRATMR_Msk                                    (0x1UL << USB_OTG_DCFG_ERRATMR_Pos)                            /*!< 0x00008000 */
#define USB_OTG_DCFG_ERRATMR                                        USB_OTG_DCFG_ERRATMR_Msk                                       /*!< Erratic error interrupt mask */

