betaflight/betaflight/lib/main/APM32F4/Libraries/Device/Geehy/APM32F4xx/Include/apm32f411xx.h
#define USB_OTG_DCFG_PSITV_Pos                                      (24U)
#define USB_OTG_DCFG_PSITV_Msk                                      (0x3UL << USB_OTG_DCFG_PSITV_Pos)                              /*!< 0x03000000 */
#define USB_OTG_DCFG_PSITV                                          USB_OTG_DCFG_PSITV_Msk                                         /*!< Periodic scheduling interval */
#define USB_OTG_DCFG_PSITV_0                                        (0x1UL << USB_OTG_DCFG_PSITV_Pos)                              /*!< 0x01000000 */
#define USB_OTG_DCFG_PSITV_1                                        (0x2UL << USB_OTG_DCFG_PSITV_Pos)                              /*!< 0x02000000 */

/********************  Bit definition for USB_OTG_PCGCCTL register  ********************/
#define USB_OTG_PCGCCTL_PCLKSTOP_Pos                                (0U)
#define USB_OTG_PCGCCTL_PCLKSTOP_Msk                                (0x1UL << USB_OTG_PCGCCTL_PCLKSTOP_Pos)                        /*!< 0x00000001 */
#define USB_OTG_PCGCCTL_PCLKSTOP                                    USB_OTG_PCGCCTL_PCLKSTOP_Msk                                   /*!< Stop PHY clock */
#define USB_OTG_PCGCCTL_GCLK_Pos                                    (1U)
#define USB_OTG_PCGCCTL_GCLK_Msk                                    (0x1UL << USB_OTG_PCGCCTL_GCLK_Pos)                            /*!< 0x00000002 */
#define USB_OTG_PCGCCTL_GCLK                                        USB_OTG_PCGCCTL_GCLK_Msk                                       /*!< Gate HCLK */
#define USB_OTG_PCGCR_PHYSUS_Pos                                    (4U)
#define USB_OTG_PCGCR_PHYSUS_Msk                                    (0x1UL << USB_OTG_PCGCR_PHYSUS_Pos)                            /*!< 0x00000010 */
#define USB_OTG_PCGCR_PHYSUS                                        USB_OTG_PCGCR_PHYSUS_Msk                                       /*!< PHY suspended */

/********************  Bit definition for USB_OTG_GINT register  ********************/
#define USB_OTG_GINT_SEFLG_Pos                                      (2U)
#define USB_OTG_GINT_SEFLG_Msk                                      (0x1UL << USB_OTG_GINT_SEFLG_Pos)                              /*!< 0x00000004 */
#define USB_OTG_GINT_SEFLG                                          USB_OTG_GINT_SEFLG_Msk                                         /*!< Session end detected                   */
#define USB_OTG_GINT_SREQSUCCHG_Pos                                 (8U)
#define USB_OTG_GINT_SREQSUCCHG_Msk                                 (0x1UL << USB_OTG_GINT_SREQSUCCHG_Pos)                         /*!< 0x00000100 */
#define USB_OTG_GINT_SREQSUCCHG                                     USB_OTG_GINT_SREQSUCCHG_Msk                                    /*!< Session request success status change  */
#define USB_OTG_GINT_HNSUCCHG_Pos                                   (9U)
#define USB_OTG_GINT_HNSUCCHG_Msk                                   (0x1UL << USB_OTG_GINT_HNSUCCHG_Pos)                           /*!< 0x00000200 */
#define USB_OTG_GINT_HNSUCCHG                                       USB_OTG_GINT_HNSUCCHG_Msk                                      /*!< Host negotiation success status change */
#define USB_OTG_GINT_HNFLG_Pos                                      (17U)
#define USB_OTG_GINT_HNFLG_Msk                                      (0x1UL << USB_OTG_GINT_HNFLG_Pos)                              /*!< 0x00020000 */
#define USB_OTG_GINT_HNFLG                                          USB_OTG_GINT_HNFLG_Msk                                         /*!< Host negotiation detected              */
#define USB_OTG_GINT_ADTOFLG_Pos                                    (18U)
#define USB_OTG_GINT_ADTOFLG_Msk                                    (0x1UL << USB_OTG_GINT_ADTOFLG_Pos)                            /*!< 0x00040000 */
#define USB_OTG_GINT_ADTOFLG                                        USB_OTG_GINT_ADTOFLG_Msk                                       /*!< A-device timeout change                */
#define USB_OTG_GINT_DEBDFLG_Pos                                    (19U)
#define USB_OTG_GINT_DEBDFLG_Msk                                    (0x1UL << USB_OTG_GINT_DEBDFLG_Pos)                            /*!< 0x00080000 */
#define USB_OTG_GINT_DEBDFLG                                        USB_OTG_GINT_DEBDFLG_Msk                                       /*!< Debounce done                          */

/********************  Bit definition for USB_OTG_DCTRL register  ********************/
#define USB_OTG_DCTRL_RWKUPS_Pos                                    (0U)
#define USB_OTG_DCTRL_RWKUPS_Msk                                    (0x1UL << USB_OTG_DCTRL_RWKUPS_Pos)                            /*!< 0x00000001 */
#define USB_OTG_DCTRL_RWKUPS                                        USB_OTG_DCTRL_RWKUPS_Msk                                       /*!< Remote wakeup signaling */
#define USB_OTG_DCTRL_SDCNNT_Pos                                    (1U)
#define USB_OTG_DCTRL_SDCNNT_Msk                                    (0x1UL << USB_OTG_DCTRL_SDCNNT_Pos)                            /*!< 0x00000002 */
#define USB_OTG_DCTRL_SDCNNT                                        USB_OTG_DCTRL_SDCNNT_Msk                                       /*!< Soft disconnect         */
#define USB_OTG_DCTRL_GINAKSTS_Pos                                  (2U)
#define USB_OTG_DCTRL_GINAKSTS_Msk                                  (0x1UL << USB_OTG_DCTRL_GINAKSTS_Pos)                          /*!< 0x00000004 */
#define USB_OTG_DCTRL_GINAKSTS                                      USB_OTG_DCTRL_GINAKSTS_Msk                                     /*!< Global IN NAK status    */
#define USB_OTG_DCTRL_GONAKSTS_Pos                                  (3U)
#define USB_OTG_DCTRL_GONAKSTS_Msk                                  (0x1UL << USB_OTG_DCTRL_GONAKSTS_Pos)                          /*!< 0x00000008 */
#define USB_OTG_DCTRL_GONAKSTS                                      USB_OTG_DCTRL_GONAKSTS_Msk                                     /*!< Global OUT NAK status   */

#define USB_OTG_DCTRL_TESTSEL_Pos                                   (4U)
#define USB_OTG_DCTRL_TESTSEL_Msk                                   (0x7UL << USB_OTG_DCTRL_TESTSEL_Pos)                           /*!< 0x00000070 */
#define USB_OTG_DCTRL_TESTSEL                                       USB_OTG_DCTRL_TESTSEL_Msk                                      /*!< Test control */
#define USB_OTG_DCTRL_TESTSEL_0                                     (0x1UL << USB_OTG_DCTRL_TESTSEL_Pos)                           /*!< 0x00000010 */
#define USB_OTG_DCTRL_TESTSEL_1                                     (0x2UL << USB_OTG_DCTRL_TESTSEL_Pos)                           /*!< 0x00000020 */
#define USB_OTG_DCTRL_TESTSEL_2                                     (0x4UL << USB_OTG_DCTRL_TESTSEL_Pos)                           /*!< 0x00000040 */
#define USB_OTG_DCTRL_GINAKSET_Pos                                  (7U)
#define USB_OTG_DCTRL_GINAKSET_Msk                                  (0x1UL << USB_OTG_DCTRL_GINAKSET_Pos)                          /*!< 0x00000080 */
#define USB_OTG_DCTRL_GINAKSET                                      USB_OTG_DCTRL_GINAKSET_Msk                                     /*!< Set global IN NAK         */
#define USB_OTG_DCTRL_GINAKCLR_Pos                                  (8U)
#define USB_OTG_DCTRL_GINAKCLR_Msk                                  (0x1UL << USB_OTG_DCTRL_GINAKCLR_Pos)                          /*!< 0x00000100 */
#define USB_OTG_DCTRL_GINAKCLR                                      USB_OTG_DCTRL_GINAKCLR_Msk                                     /*!< Clear global IN NAK       */
#define USB_OTG_DCTRL_GONAKSET_Pos                                  (9U)
#define USB_OTG_DCTRL_GONAKSET_Msk                                  (0x1UL << USB_OTG_DCTRL_GONAKSET_Pos)                          /*!< 0x00000200 */
#define USB_OTG_DCTRL_GONAKSET                                      USB_OTG_DCTRL_GONAKSET_Msk                                     /*!< Set global OUT NAK        */
#define USB_OTG_DCTRL_GONAKCLR_Pos                                  (10U)
#define USB_OTG_DCTRL_GONAKCLR_Msk                                  (0x1UL << USB_OTG_DCTRL_GONAKCLR_Pos)                          /*!< 0x00000400 */
#define USB_OTG_DCTRL_GONAKCLR                                      USB_OTG_DCTRL_GONAKCLR_Msk                                     /*!< Clear global OUT NAK      */
#define USB_OTG_DCTRL_POPROGCMP_Pos                                 (11U)
#define USB_OTG_DCTRL_POPROGCMP_Msk                                 (0x1UL << USB_OTG_DCTRL_POPROGCMP_Pos)                         /*!< 0x00000800 */
#define USB_OTG_DCTRL_POPROGCMP                                     USB_OTG_DCTRL_POPROGCMP_Msk                                    /*!< Power-on programming done */

